{
  "drivers-bio": [
    {
      "name": "Lewis Hamilton",
      "biography": "‘Still I Rise’ – these are the words emblazoned across the back of Lewis Hamilton’s helmet and tattooed across his shoulders, and ever since annihilating expectations with one of the greatest rookie performances in F1 history in 2007, that’s literally all he’s done: risen to the top of the all-time pole positions list ahead of his hero Ayrton Senna, surged into first place in the wins column surpassing the inimitable Michael Schumacher, and then matched the legendary German’s seven world titles. Is he the G.O.A.T? Few would deny that he’s in the conversation – and what’s more he’s got there his way, twinning his relentless speed with a refusal to conform to stereotypes for how a racing driver should think, dress or behave. Respect is hard earned in F1, but Hamilton – now Sir Lewis Hamilton to be precise – has it from every one of his peers. Why? Because they know that whatever the track, whatever the conditions, whatever the situation, when his visor goes down and the lights go out, it’s Hammertime",
      "id": 1
    },
    {
      "id": 2,
      "name": "George Russell",
      "biography": "He’s the driver with the motto: “If in doubt, go flat out”. George Russell has lived by it throughout his F1 career to date, out-qualifying seasoned team mate Robert Kubica at all 21 Grands Prix in his rookie season, putting Williams back on the podium in 2021, and landing his first race win with Mercedes in 2022. That brilliant baseline speed served Russell well as he totted up titles on his way to Formula 1. The Briton stormed to the 2017 GP3 championship and delivered the 2018 Formula 2 crown under immense pressure. Spotting his potential, world champions Mercedes swooped to sign him to their junior programme in 2017, when Russell already had a DTM deal on the table. He banked more experience with practice sessions with Force India and tests for the Silver Arrows, before landing his Mercedes-powered Williams race drive. A refusal to cede ground to his rivals - and commitment to a tricky pass – underpins Russell’s winning mentality. And it’s what got him the call-up to replace Lewis Hamilton for a one-off Mercedes appearance for Sakhir 2020 when the reigning champ was struck down by Covid-19. That star turn saw Russell miss out on pole by just 0.026s and then outrace Mercedes stalwart Valtteri Bottas. Only a bungled pit stop and a heart-breaking late puncture prevented a near-certain maiden win for the up-and-coming super-sub. He kept his head down at Williams in 2021, scoring his first points and podium, all the while keeping his eye on the bigger prize. Having proved himself a hard worker and a tenacious talent, that prize arrived in the form of a chance to take on compatriot and seven-time champion Hamilton in identical machinery. It was an opportunity Russell relished, as he took his first F1 win – and Mercedes’ only 2022 victory – in Brazil, en route to fourth in the drivers’ championship, two places and 35 points ahead of his illustrious team mate. If the Silver Arrows can produce a truly competitive car for 2023, a title bid surely beckons. A huge challenge, but as always, ‘Russell the Rocket’ will be going flat out."
    },
    {
      "id": 3,
      "name": "Sergio Perez",
      "biography": "He’s the fighter with a gentle touch from the land of the Lucha Libre. Perez’s reputation in F1 has been built on opposite approaches to Grand Prix racing. On the one hand, he is a punchy combatant who wrestles his way through the pack and into the points. Never afraid to add a bit of spice to his on-track encounters, even his team mates don’t always escape the Mexican’s heat. Then on the other hand, Perez is a smooth operator, a master at managing tyres to eke out extra performance and give him the upper hand on strategy. A firm favourite on the grid after his time with Sauber, McLaren, Force India and Racing Point, Perez has matured into an analytical racer and team player. A proud countryman, the Guadalajara gunslinger has amassed more points than any other Mexican in the history of F1. In Sakhir 2020 he also matched hero and compatriot Pedro Rodriguez by taking the chequered flag in first – a performance that landed him a seat with title contenders Red Bull. There he provided strong support to Max Verstappen’s 2021 and '22 championship-winning campaigns, also adding a further three victories to his own tally. More wins may not be assured, especially with Verstappen as team mate, but Perez working hard and racing with his heart are."
    },
    {
      "id": 4,
      "name": "Max Verstappen",
      "biography": "He’s Max by name, and max by nature. Arriving as Formula 1’s youngest ever competitor at just 17 years old, Verstappen pushed his car, his rivals and the sport’s record books to the limit. The baby-faced Dutchman with the heart of a lion took the Toro Rosso – and then the Red Bull – by the horns with his instinctive racing style. F1’s youngest points scorer soon became its youngest race winner – at the age of 18 years and 228 days – with an opportunistic but controlled drive on debut for Red Bull in Barcelona 2016. A true wheel-to-wheel racer, another stunning drive in Brazil from the back of the pack to the podium on a treacherous wet track kept the plaudits coming. Verstappen’s no-holds-barred attitude and hard defending have sometimes landed him in hot water with his peers and paymasters. But the mistakes that initially marred his potential have given way to maturity, while the bravado and energy that make him a blockbuster talent have remained – and the victories have kept on coming. They culminated in his first F1 drivers’ crown after that already legendary, final-round showdown with Lewis Hamilton in 2021. And he followed that up with a powerhouse title defence in 2022, winning a record 15 races across the season. The son of former F1 driver Jos Verstappen and super-quick karting Mum Sophie Kumpen, racing runs through his genes. Despite moving out of Dad’s house to live in Monaco, Verstappen remains close to his family, and though he’s not afraid to speak his mind, he can still be surprisingly shy.Having become the Netherlands' first world champion aged just 24, the expectations for the next generation’s leading light are sky high – but with Verstappen there’s a feeling that the sky’s the limit."
    },
    {
      "id": 5,
      "name": "Charles Leclerc",
      "biography": "Born in the Mediterranean idyll of Monaco, Leclerc arrived in F1 on a tidal wave of expectation. Practically peerless on his way to the GP3 and Formula 2 crowns, he showcased a dazzling array of skills from scorching pole positions, commanding victories – even when his car caught fire twice at Silverstone – to an ability to muscle his way through the pack. Winning back-to-back championships also taught Leclerc how to handle pressure, another useful tool in the big pond of Formula 1 racing. Stepping up to F1 in 2018, Leclerc showed flashes of ballistic pace on Saturdays and racing brilliance on Sundays, dragging his Sauber beyond its limits – and earning himself a money-can’t-buy race seat at Ferrari for 2019, stepping into the shoes of the Scuderia’s last world champion, Kimi Raikkonen. There he immediately put the cat among the proverbial pigeons, unafraid to go wheel-to-wheel with established number one, Sebastian Vettel. A maiden F1 victory at Spa was followed by another a week later on Ferrari’s hallowed home turf of Monza. The tifosi had found another new hero – who then became the first man to out-score Vettel over a season with the Scuderia, a feat he repeated in crushing fashion the following year. The 2020 and ’21 seasons bore little fruit for Ferrari, but Leclerc maintained his resolve to emerge a true title contender in 2022. With three wins, 11 podiums and nine pole positions, he was the only man able to consistently take the fight to champion Max Verstappen. Out of the car, Leclerc is modest and thoughtful - but then he is on his own very personal mission. This exciting young talent is racing for his late father Herve and his friend and mentor Jules Bianchi, the F1 driver who died in 2015. On the evidence so far, he is doing them both proud."
    },
    {
      "id": 6,
      "name": "Carlos Sainz Jr",
      "biography": "He’s the matador from Madrid racing royalty. After entering F1’s Bull Ring paired alongside Max Verstappen at Toro Rosso in 2015, Sainz quickly showed his fighting spirit. A tenacious racer, he puts the car on the edge as he hustles his way through the pack. No wonder Sainz has earned the nickname Chilli. But the Spaniard is intelligent as well as instinctive, thinking his way through a race and into the points. This calm temperament follows him off track where he remains unfazed by the pressures of forging a Grand Prix career with a famous name. Sainz is the son of double World Rally champion, also his namesake, and has brought some of Dad’s driving skills to the F1 circuit – junior loves a delicious dose of drift for one. After following in his famous father’s tyre tracks, Sainz has had big racing boots to fill – first at McLaren where he replaced his childhood hero Fernando Alonso, and now at Ferrari, in the seat formerly owned by Sebastian Vettel. It is never easy living in the shadow of sporting giants, but Sainz has shown the drive and disposition to deal with it, and in 2022 he took his maiden F1 win with victory at Silverstone. Vamos!"
    },
    {
      "id": 7,
      "name": "Oscar Piastri",
      "biography": "Born in Melbourne, just a stone’s throw away from the Australian Grand Prix venue, a young Oscar Piastri’s dreams of one day racing in Formula 1 were ignited by the sport’s star drivers roaring around his local streets, otherwise known as Albert Park. But it would take huge commitment and sacrifice to turn that dream into a reality, with a move to Europe – made by the likes of fellow countrymen Mark Webber and Daniel Ricciardo before him – the only way to go up against the best and catch the attention of the sport’s decision-makers. Using success on the Australian karting scene as a springboard, Piastri continued to learn the craft in championships across Europe, before getting his first taste of single-seater competition as a 15-year-old – two podium finishes in F4 UAE a sign of things to come. From there, success flowed. British F4 runner-up. Formula Renault champion. F3 champion. F2 champion (by more than 50 points). Piastri did not simply climb the junior single-seater ladder, he charged up it to knock loudly on the F1 door. So impressive was Piastri that two F1 teams squabbled over his services for 2023, adding a new dimension to the driver market and so-called ‘silly season’. After a meeting of the Contract Recognition Board, it was confirmed that it was McLaren, and not long-time backers Alpine, that had the right to Piastri’s services, and with whom the 21-year-old is set to realise his F1 dream."
    },
    {
      "id": 8,
      "name": "Lando Norris",
      "biography": "Lando Norris may not be named after Star Wars rebel Lando Calrissian - his Mum just liked the moniker - but he has flair and fighting spirit in bountiful supply. McLaren had the British teenager on their books for two years before fast-tracking him into F1’s galaxy of stars in 2019. A firecracker in his junior career, with a penchant for pole positions and wheel-to-wheel tussles, Norris didn’t let them down. Paired with the highly-rated – and far more experienced – Carlos Sainz, his rookie season was impressive, Norris edging the Spaniard in their head-to-head qualifying battle, scoring points 11 times, and only narrowly missing out on a top-10 championship placing. A maiden podium came in 2020, with more following in the subsequent two seasons – he narrowly missed out on a win at Russia 2021 – as he dominated another more senior team mate, Daniel Ricciardo, to firmly establish himself in F1’s top tier. An exciting talent on track, away from it Norris brims with a modest charm and an artistic side sees him design and paint his own race gear as a hobby. The focus for the future is allying artistry and ambition on track as McLaren rely on the promise of youth to take them back to the top. Norris hopes the downforce will be with him…"
    },
    {
      "id": 9,
      "name": "Esteban Ocon",
      "biography": "If there’s one word that dominates Esteban Ocon’s career, it’s ‘sacrifice’. Back when he was just a promising karter, Ocon’s parents sold their house, put their jobs on hold, and began a life on the road, living in a caravan and travelling from circuit to circuit to support their son’s burgeoning career. Sacrifice, see – but it worked. 2014 saw Ocon break through in the world of single-seaters, as he beat a certain Max Verstappen to the European F3 title. Backed by Mercedes, he won the GP3 title the following year and was halfway through a season of DTM in 2016 when he was offered the chance to replace Rio Haryanto at the minnow Manor team from the Belgian Grand Prix onwards. That opportunity led to a full-time seat the following year with Force India, where his wheel-to-wheel duels with highly-rated team mate Sergio Perez quickly marked him out as a rising star. But when Lawrence Stroll, father of racer Lance, stepped in midway through 2018 to secure the squad’s financial future, the writing was on the wall for Ocon, who was moved aside at the end of the year to allow Stroll Jnr to join from Williams. Ocon bided his time, though, and after a year on the sidelines as Mercedes’ reserve driver, he found his way back into a race seat for 2020 with Renault, who became Alpine for 2021 – when his wait finally paid off, as he scored his – and the famous French marque’s – first F1 win. Nothing in Ocon’s motorsport career has come easy – but if Ocon has managed to return to the F1 grid and step atop the podium, it’s through a combination of self-belief, determination and a talent that’s up there with the very best."
    },
    {
      "id": 10,
      "name": "Pierre Gasly",
      "biography": "If there’s one man who knows how big a rollercoaster ride an F1 driver’s career can be, it’s Pierre Gasly! The flying Frenchman was called up to make his 2017 debut in Malaysia in place of Daniil Kvyat and, after proving his mettle, he was named a Toro Rosso driver the following year.  A further 21 races into his fledgling career, Gasly was moved up again – this time to replace Red Bull big gun Daniel Ricciardo. Gasly seemed to have a knack of being in the right place at the right time – a quality that’s equally handy on track. A series of impressive 2018 performances for Toro Rosso – including a brilliant fourth place in Bahrain – showed exciting promise for what he might do with the ‘A’ team in 2019. Unfortunately that promise only appeared in flashes – and he quickly suffered from unfavourable comparisons with superstar team mate Max Verstappen. So much so that after the summer break, he was sent back to Toro Rosso, with another young up-and-comer – Alex Albon – being given a shot in the ‘senior’ Red Bull seat. But Gasly bounced back, as only Gasly can. In the season’s remaining nine races he scored almost as many points as team mate Kvyat managed over the entire year – and secured his best-ever race result with P2 in Brazil. That trajectory continued in 2020, peaking with an emotional maiden win at the renamed AlphaTauri team’s home race in Italy, and didn’t let up in 2021 when he was back on the podium and scored 110 of the squad’s 142 points. When AlphaTauri’s momentum stalled in 2022, Gasly decided it was time for a change – in the form of French team Alpine, with fellow Frenchman – and old adversary – Esteban Ocon as team mate.  The question now is can he regain momentum and get himself another shot at the F1 bigtime…"
    },
    {
      "id": 11,
      "name": "Nico Hulkenberg",
      "biography": "He’s the Superhero with the talent to become a racing superstar – if only he could get to flex his muscles with a top team. F1’s 'Hulk' has shown incredible strength and stamina as a midfield marauder for Williams, Force India, Sauber, Renault, Racing Point and Aston Martin during a career spanning back to 2010 – and now he is back on the grid with Haas. In that rookie season, Hulkenberg mastered changing track conditions to take a brilliant pole position in Brazil, showing he had brains as well as brawn. Since then his ability to consistently hoover up the points has made him a highly valued team player. In 2015, his reputation grew once more when, on a weekend away from his day job, he won the classic Le Mans 24 Hours race for Porsche at the first time of asking. Hulkenberg’s off-track alter ego is down to earth – he’s the sort of driver who holds his own umbrella when it’s raining on the way to the grid – with a cheeky sense of humour. When he reached the unwanted record of most race starts without a podium finish he laughed it off as the start of the 'Hulkenberg era'. Thankfully, even after being dropped by Renault at the end of 2019, the popular German’s era continued with some stand-in (and stand-out) drives in 2020 and 2022, and given the opportunity, the ‘Hulk’ now has another chance to set the record straight."
    },
    {
      "id": 12,
      "name": "Kevin Magnussen",
      "biography": "Call him a lone ranger or a maverick, but Magnussen is back in Formula 1 for one reason only – to race. He may be a second-generation F1 driver – following his father, Jan, onto the grid – but Magnussen’s idols are from the ‘golden era’ of Grand Prix racing when the likes of Juan Manuel Fangio and Stirling Moss risked it all for the love of the sport. The Roskilde racer’s own prowess was proven on debut for McLaren, who guided him through the junior ranks, when he cruised into the top-three at the 2014 Australian Grand Prix, becoming the first Dane to claim a podium in F1. Other champagne moments were more difficult to find, as he left McLaren behind for a season with Renault, before settling in for four among kindred spirits at Haas. And after a year away in the States, racing Indy and sportscars among other things, he returned to the US team in 2022, securing their first-ever pole position at the Brazilian Grand Prix. His meaty manoeuvres and elbows-out approach have earned him a bad-boy reputation on track, something that still leaves him baffled. Out of the car Magnussen is laidback and affable. After all he has his dream job – and he is only here to race."
    },
    {
      "id": 13,
      "name": "Alexander Albon",
      "biography": "Born in London but racing under the flag of Thailand, Alexander Albon’s first word was in fact Italian. That word was Ferrari – though it was with another Italian team that he got his big F1 break. Idolising Michael Schumacher and dreaming of one day racing in Formula 1, the junior Albon was pipped to the 2016 GP3 title by a certain Charles Leclerc. He then left his great friendship with George Russell trackside as he took the 2018 Formula 2 title fight down to the wire. Graduating to the F1 big league along with yet another contemporary – Lando Norris – in 2019, Albon did his talking on track with Toro Rosso in the opening races, earning a mid-season promotion to Red Bull Racing. A stylish over-taker with a championship mentality, Albon was unfazed by partnering Max Verstappen for the second half of his rookie season, taking top-six finishes in eight of his nine 2019 races with Red Bull. Staying in touch with the future champion proved tougher in 2020 and Red Bull dropped him from their race line-up. Crucially, though, Albon was retained as test and reserve driver, keeping him very much on team bosses’ radar, leading to his 2022 return to the grid with Williams. Laidback and cheerful with a cheeky grin, the Thai racer is popular among his peers – not always easy in motorsport’s cauldron of competition – but you don’t succeed in Formula 1 by being popular. Albon’s challenge now is a big one – to make the most of a rare second F1 opportunity."
    },
    {
      "id": 14,
      "name": "Logan Sargeant",
      "biography": "Logan Sargeant becomes F1’s first American driver in almost eight years as he takes to the grid for the 2023 season, giving the country a home favourite to cheer once more. A prolific title winner in karting, championship glory eluded Sargeant after he made the transition to single-seater racing, but pole positions and race victories in almost every category he contested underlined his raw speed and potential. Indeed, finishing runner-up in F4 UAE, third in British F4 and third in F3 (having also made the podium at the prestigious Macau Grand Prix) showed he could be there or thereabouts in a variety of championships, with plenty of potential still to be untapped. It also convinced Williams to add the youngster to their books as he reached F2, where more race wins and another top-three classification in 2022 secured the Super Licence points required to complete the journey and graduate to F1 with the Grove team for 2023. Not since Alexander Rossi’s quintet of appearances with backmarkers Manor at the tail-end of the 2015 season has an American graced the F1 grid, and Sargeant is looking forward to changing that across his first season. And with three races to be held in the US in 2023 – trips to Miami, Austin and Las Vegas all planned – America’s latest F1 star will be spurred on by plenty of home support during his rookie campaign."
    },
    {
      "id": 15,
      "name": "Guanyu Zhou",
      "biography": "China has never boasted a Grand Prix starter among its citizens – but Zhou Guanyu is the driver charged with changing that state of affairs, after receiving the call-up to make his F1 debut for Alfa Romeo in 2022. The Shanghai-born racer attended his home city’s inaugural Grand Prix in 2004 at the age of five, cheering on his hero Fernando Alonso. But having caught the racing bug, the Chinese driver then set himself the ambitious goal of becoming his country’s first-ever F1 racer – achieving a feat that Ma Qinghua, the only other Chinese driver to take part in a Formula 1 weekend, never managed. Showing boldness and dedication, Zhou put his plan into action by moving to England with his family aged just 12 to pursue his motorsport ambitions. A second-place finish in the 2015 Italian F4 championship proved Zhou was possessed of the right stuff – a fact already noted by Ferrari, who’d signed him to their driver academy a year earlier. A move to Renault’s academy for 2019 coincided with his debut in Formula 2, with Zhou building his confidence in the series via multiple wins and pole positions across three seasons, leading to him challenging for the drivers’ title in 2021. That was enough to convince Alfa Romeo Team Principal Fred Vasseur to put his faith in Zhou for 2022 and field him alongside ex-Mercedes racer Valtteri Bottas – allowing Zhou to achieve his dream of racing in F1, and even to see how he fares against his own childhood hero, Fernando Alonso."
    },
    {
      "id": 16,
      "name": "Valtteri Bottas",
      "biography": "Learning his craft on Finnish roads of ice and snow, he was born to be a Grand Prix racer. Bottas explains that if you can drive on the frozen roads of his homeland then you can drive anywhere. Then there’s the Finnish mentality –reserved, diligent and calm the fast lane of F1 doesn’t faze him. Making his F1 debut with Williams in 2013, Bottas soon became part of the family. Points and podiums followed with the reliable racer even amassing the most points without a win, a record he resented but that showcased his ability. The fact the Finn was such a points machine saw him suddenly promoted to the most coveted seat in F1 - Nico Rosberg’s vacant championship-winning seat at Mercedes. Bottas blossomed at the Silver Arrows in 2017, unleashing his pace to clock up personal pole positions and victories as well as a team championship for the famous Mercedes marque alongside Lewis Hamilton. He even tied with Hamilton and Sebastian Vettel with 13 podiums. For a shy guy, it brought a confidence boost and a new swagger – albeit in a very demur Finnish fashion. He would need all that confidence in 2018 – a season Bottas described as his worst in F1, as he took zero wins to Hamilton’s 11. That, though, was a reflection more of his team mate’s brilliance than of any shortcomings on his own part. Bottas stepped it up a level in 2019, four victories securing a convincing second in the championship behind Hamilton, but that dropped to two wins to his team mate's 11 in 2020 and then just one in 2021, prompting Mercedes to drop him after five seasons. In 2022 he started a new chapter in his F1 career, replacing compatriot Kimi Raikkonen to lead an all-new line-up at Alfa Romeo, and taking Chinese rookie Zhou Guanyu under his wing."
    },
    {
      "id": 17,
      "name": "Fernando Alonso",
      "biography": "Michael Schumacher was the undisputed king of Formula 1 in the early 2000s, picking up wins and championships at a rate that was simply unheard of at the time. It was going to take someone very special to topple the Ferrari legend from his throne – and that it was Fernando Alonso who did it, tells you all you need to know about the Spaniard. Fiercely competitive, Alonso is not shy about his talent, rating himself as 9/10 “in everything”, and few in the know would disagree, with his performances in F1 characterised by blistering speed, brilliant tactical thinking, exemplary race craft, a razor-sharp eye for detail and a relentless determination to win. A serial record breaker in his early days, he was – at one time – F1’s youngest polesitter, race winner, world champion and double world champion as he gobbled up success with the Renault team. Even Alonso couldn’t continue that amazing run in his later career though, failing to add another title to his collection despite spells at McLaren and Ferrari. But after two years away from Formula 1 racing – and with two Le Mans wins in his pocket – Alonso returned with Alpine in 2021. His speed and determination undiminished, he was back on the podium that year, but frustrated by poor reliability – and the lack of a long-term contract – the following season, he opted to jump ship once more. Now Alonso hopes Aston Martin will be the team with whom he finally returns to winning ways, as he has unfinished business with F1…"
    },
    {
      "id": 18,
      "name": "Lance Stroll",
      "biography": "There is no such thing as too much too soon for Stroll, a teenage sensation with a wet weather predilection. One of the cool kids on the grid, Stroll was unveiled shortly after his 18th birthday by Williams – before he finished high school and got his road licence. Stroll meant business in his debut 2017 season, setting records on the way. An opportunistic racer he bounded onto the podium in Baku, the youngest rookie to do so. As the son of a wealthy entrepreneur, Stroll is used to a champagne lifestyle but now he knows the fizz tastes all the sweeter on the rostrum. Then in Monza he mastered the downpours to become the youngest driver in history to line up on the front row. A single-minded starter, the Canadian loves to make up places on the opening lap and fight through to the points. Stroll has the potential to be a long-term fixture in Formula 1 – as amply illustrated by a maiden pole and another two podiums in 2020. Those came after his father Lawrence led the consortium that took over Force India midway through the 2018 season, and then transformed it from Racing Point to Aston Martin for 2021. The future looks bright for both the team and their young driver – and even if it rains then Stroll can keep on motoring at the sharp end of the pack."
    },
    {
      "id": 19,
      "name": "Daniel Ricciardo",
      "biography": "The self-styled “Honey Badger” is fuzzy on the outside and feisty on the inside. Drivers beware because behind Ricciardo’s laidback persona and big grin is a razor-sharp racer with a bite. The Australian combines all-out speed with impressive race craft. Never afraid to push to the limits if it means pulling off a pass, Ricciardo is a proven race-winner, capable of consistently finishing at the business end of the championship table given the right machinery.A regular podium-finisher in his days with Red Bull, Ricciardo has christened the steps around the world with a dousing of Aussie culture – the ‘Shoey’ – as he quaffed champagne from a soggy racing boot. Yes it’s goofy, but the trademark celebration illustrates why he is loved for his sense of humour but never underestimated on track. His career’s next moves to Renault’s works team in 2019 and then McLaren for 2021 brought fresh challenges for the Perth pilot, but failed to deliver his dream of following Jack Brabham and Alan Jones as the next world champion from Down Under – and left him off the grid for the start of 2023. Unfortunately the comeback was short-lived. After suffering a broken hand in a practice crash at Zandvoort he was ruled out of the Dutch and Italian Grands Prix, with fellow Antipodean Liam Lawson standing in. For now his exact return date remains unknown – but whatever happens next, Ricciardo is sure to keep on smiling."
    },
    {
      "id": 20,
      "name": "Yuki Tsunoda",
      "biography": "In the entire history of Formula 1, no Japanese driver has ever won a World Championship Grand Prix. Could Yuki Tsunoda be the first? Red Bull certainly think so, with the youngster very much on the path to their senior team if he continues to impress as he has done over the past few years. Tsunoda's ascent to the top tier of motorsport was astonishingly rapid: he went from racing in Japanese F4 to a Formula 1 seat with AlphaTauri in just over three years, having arrived in Europe in 2019 with no knowledge of the circuits. But after a slow start in F3, followed by a hugely impressive debut F2 campaign that saw him finish third in the championship and pick up three wins along the way, Tsunoda proved he had the speed and the race craft to force his way on to the F1 grid. He may not have adapted to Grand Prix racing quite as quickly as he did to F2, but given time he could yet find himself battling at the very sharp end in a Red Bull."
    },
    {
      "name": "Nyck De Vries",
      "biography": "A fine example of what is possible when a chance opportunity is grasped with both hands, Nyck de Vries scored points in his stand-in performance for Williams at Monza last season, which led directly to his first full Formula 1 season in 2023 with AlphaTauri. \n\nWhile those in the know had never doubted the credentials of de Vries – a title winner in Formula 2 and Formula E in 2019 and 2020-21 respectively – it took a last minute call up to replace appendicitis-stricken Alex Albon at Williams for the 2022 Italian Grand Prix to fortuitously put those talents under the nose of F1 bosses directly.  \n\nFor many, de Vries’ appointment by AlphaTauri for the 2023 F1 World Championship season is belated justice for a driver that had been considered unfairly overlooked for a seat ever since he swept to the 2019 F2 title. A prized member of the McLaren young driver programme from the age of 15, de Vries’ prestigious backing was validated by a series of titles in karting prior to his move into open-wheel racing. \n\nJoining the roster of would-be F1 stars by winning the Eurocup Formula Renault 2.0 title in 2014, de Vries consolidated his burgeoning reputation with race-winning turns in the Formula Renault 3.5 Series and the GP3 Series in the following years. \n\nThe Dutchman made his F2 debut in 2017, starting the season with Rapax before switching to Racing Engineering part way through the season. Ending the year seventh overall, de Vries was picked up by Prema by Theodore Racing to defend its title following Charles Leclerc’s success the previous year.  \n\nHowever, despite achieving a trio of wins, de Vries was out-performed by title winner George Russell, Lando Norris and Alex Albon, each of whom earned a promotion to F1 instead. \n\nNevertheless, de Vries’ moment finally came in 2019 when, after succeeding Russell in the ART Grand Prix team, he waltzed comfortably to the title with four victories to his name. \n\nWith no F1 seats available for 2020, de Vries switched allegiance from McLaren to Mercedes to become both its F1 test driver and to head up its new Mercedes-Benz EQ Formula E team. \n\nDebuting in 2019-20, de Vries and Mercedes’ relative lack of experience in the notoriously unpredictable series was tested further by a COVID-19-affected season punctuated by a huge six-month chasm between Round 5 and the ‘Super Six-race’ Round 6 finale in Berlin.  \n\nThough COVID-19 continued to wreak havoc with schedules into the 2020-21 season, de Vries and Mercedes EQ’s better steer on Formula E told as he kept his cool to emerge champion of Season 7. \n\nDovetailing his single-seater exploits with several creditable performances in sportscars – including strong finishes in the Le Mans 24 Hours – de Vries’ headline-grabbing debut with Williams subsequently thrust him to the forefront of the silly season driver rumours. \n\nIn the end, it was AlphaTauri that would win the race for his signature, de Vries making his full-time debut with the Red Bull-affiliated team for the 2023 F1 season",
      "id": 21
    }
  ],
  "race-report": [
    {
      "id": 2,
      "race": "Saudi Arabia Grand Prix",
      "report": "Sergio Perez converted pole position into victory at the Saudi Arabian Grand Prix as team mate Max Verstappen recovered from P15 to make it successive one-two finishes for Red Bull. Fernando Alonso put his Aston Martin on the podium again with a fine drive, before being stripped of P3 and then having it reinstated after a stewards’ review. Perez overcame an attack from Alonso at the start, a nervy Safety Car period and Verstappen’s charge from the midfield to make up for the potential win he lost at the Jeddah Corniche Circuit a year ago – kick-starting his 2023 championship hopes in the process. Verstappen progressed to P2 in rapid time though ultimately had to accept defeat to Perez, with the reigning world champion managing additional driveshaft concerns late in the race after the same component failed during qualifying. Alonso impressively took the lead from Perez into Turn 1 but a subsequent time penalty for lining up outside his grid box, coupled with the relentless pace of the Red Bulls, meant he had to settle for third place. Alonso’s rear jack mechanic was later judged to have touched the car before his penalty had been served, the Spaniard receiving a further 10-second penalty after the race that dropped him to P4. Upon reviewing the decision, however, the stewards ruled that Alonso’s P3 would stand, reversing their call and pushing Mercedes’s George Russell back to P4 – Alonso becoming just the sixth driver to earn 100 F1 podiums. Mercedes and Ferrari had no answers for Red Bull’s pace as they distantly followed in two-by-two formation, Russell getting the better of team mate Lewis Hamilton, and Carlos Sainz leading Charles Leclerc home. Leclerc was also tasked with a race day recovery after his pre-race grid penalty, but seventh represented a much smaller reward than Verstappen’s second-place finish, and the Monegasque could not contain his frustration over the radio. Alpine enjoyed a much stronger second round as Esteban Ocon and Pierre Gasly collected points in P8 and P9 respectively, while Haas’s Kevin Magnussen and AlphaTauri’s Yuki Tsunoda went wheel-to-wheel over the final point – the Dane coming out on top with a late move. Nico Hulkenberg took 12th in the sister Haas, as the Alfa Romeo of Zhou Guanyu beat rookie drivers Nyck de Vries (AlphaTauri), Oscar Piastri (McLaren) and Logan Sargeant (Williams) to P13. McLaren endured another tough day at the office after early front wing changes for Piastri, who clashed with Gasly at the start, and Lando Norris, who hit the debris, consigned them to evenings towards the back of the pack.Piastri ultimately crossed the line in P15 after clearing Sargeant on the final lap, something Norris narrowly avoided repeating as he settled for 17th, with Valtteri Bottas the last of the finishers amid apparent technical trouble in his Alfa Romeo.Alex Albon and Lance Stroll were the two retirements from the race; Albon encountering terminal brake problems aboard his Williams and Stroll being told to stop his Aston Martin in the early stages, taking him out of the front-running battle.Attention now turns to the third round of the 2023 F1 season in Australia, with Verstappen holding the championship lead over Perez by a point thanks to him clocking the fastest lap of the race in the dying moments"
    },
    {
      "id": 3,
      "race": "Australia Grand Prix",
      "report": "Max Verstappen claimed victory during a wild and action-packed Australian Grand Prix, overcoming battles with the Mercedes drivers, several Safety Cars and three red flags to lead home Lewis Hamilton and Fernando Alonso. Verstappen lost out to both George Russell and Hamilton at the original race start, before the Safety Car made two appearances in quick succession due to Charles Leclerc retiring from a collision with Lance Stroll and Alex Albon crashing out heavily. A subsequent red flag for Albon’s incident brought the field back to the pits, with Hamilton leading Verstappen and Alonso, taking advantage of misfortune for Russell and Carlos Sainz, who were the two front-runners to take on fresh tyres just before the stoppage. With a free choice of tyres for the restart, Hamilton initially held the lead from Verstappen, but the Red Bull driver soon got within DRS range and moved back into P1, moments before Russell’s misery was compounded by an apparent engine failure. Verstappen brushed off the early drama to move into a comfortable lead as the race developed, while Hamilton held P2 and set about managing the gap back to Alonso, who was joined by the recovering Sainz and Pierre Gasly in a fight for the podium positions. But just as the order appeared to be locked in, another Safety Car, and then another red flag, was triggered late on when Kevin Magnussen thumped the wall exiting Turn 2, lost his rear-right wheel and spread debris from his Haas over the racing line. It meant a third standing start and the prospect of a two-lap shootout on soft tyres, but just a matter of seconds passed before further contact and drama as Sainz tipped fellow Spaniard Alonso into a spin in the Turn 1 bottleneck. Behind, Gasly took avoiding action and collided with Alpine team mate Esteban Ocon as he rejoined the circuit, putting both drivers out on the spot, while Logan Sargeant ran into the back of Nyck de Vries, and Sergio Perez – who had risen from the pit lane – and Stroll had separate off-track excursions. After some confusion over how the race would proceed and the results would be determined, proceedings were resumed – and ultimately settled – behind the Safety Car in the order of the previous start, minus the cars that had been eliminated. A rolling start took the field around to the chequered flag, with Verstappen crossing the line for his first victory in Australia, as Hamilton and Alonso completed the podium ahead of Sainz, Stroll, Perez and Lando Norris. However, Sainz was hit with a five-second time penalty for his clash with Alonso, promoting everyone behind him as Nico Hulkenberg took P7, from home favourite Oscar Piastri, Zhou Guanyu, Yuki Tsunoda – inheriting the final point – and Valtteri Bottas. De Vries, Sargeant, Magnussen, Russell, Albon and Leclerc all watched the final lap from the sidelines, as the sun set on a hugely dramatic day at the Albert Park Circuit"
    },
    {
      "id": 4,
      "race": "Azerbaijan Grand Prix",
      "report": "Sergio Perez doubled up on the streets of Baku by adding to his Sprint race triumph with victory in Sunday’s Azerbaijan Grand Prix, leading Red Bull team mate Max Verstappen and Ferrari’s Charles Leclerc home to boost his title push.Verstappen and Perez overhauled pole-sitter Leclerc in the early stages and proceeded to trade fastest lap times at the head of the field, with the defining moment of the race coming when a Safety Car was deployed either side of the Red Bull drivers pitting. With Verstappen pitting under yellow flags brought out when Nyck de Vries stopped on track, and Perez coming in under a Safety Car that followed, the Mexican cleared his team mate and rejoined the action in the lead. Verstappen fell to third, meaning he had to overtake Leclerc for a second time. While that was a formality when the race resumed, he could not make inroads on Perez during the run to the chequered flag and had to settle for second. Leclerc held off a late charge from Fernando Alonso to take third, meaning the two-time champion’s 2023 podium run came to an end – though fourth still represented another strong haul of points for the Aston Martin driver. Carlos Sainz crossed the line fifth in the other Ferrari, fending off Lewis Hamilton’s Mercedes in the closing stages, with the Aston Martin of Lance Stroll and Silver Arrow of George Russell picking up minor points after a close call in the pits early on. Esteban Ocon and Nico Hulkenberg rose from the pit lane to hold points-paying positions for much of the race, as they extended their first stints on hard tyres, but late mandatory pit stops meant they were banking on more Safety Car drama that never arrived. McLaren’s Lando Norris moved into the points with a late move on Hulkenberg, before gaining another spot when Ocon pitted, while Yuki Tsunoda rounded out the top 10 to salvage a result for AlphaTauri. Oscar Piastri, Alex Albon, Kevin Magnussen and Pierre Gasly all narrowly missed out on points as they completed a close midfield pack, ahead of final finishers Ocon, Logan Sargeant, Hulkenberg and Valtteri Bottas – the latter making three trips to the pit lane amid tyre woes. Bottas’ Alfa Romeo team mate, Zhou Guanyu, pulled into the pits late on with an unspecified technical issue, with De Vries the other retirement after his aforementioned visit to the wall at Turn 5 in the early stages, which caused terminal damage. With back-to-back Baku wins, which add to his 2021 Grand Prix victory at the venue, Perez cuts Verstappen’s championship lead to single figures heading to the next round of the season in Miami, which follows in a week’s time. Perez, who also took home the Driver of the Day award, could have made up further ground in the drivers’ standings had it not been for a late stop from Russell, who bolted on a set of softs to grab the fastest lap bonus point"
    },
    {
      "id": 5,
      "race": "Miami Grand Prix",
      "report": "Max Verstappen struck back in the 2023 title race by beating Red Bull team mate Sergio Perez to victory during Sunday’s Miami Grand Prix, recovering from ninth on the grid and passing the pole-sitter in the closing stages of an intriguing, strategic race. Perez had slashed Verstappen’s championship advantage to just six points with a Sprint and Grand Prix double last time out in Azerbaijan, and a topsy-turvy qualifying session at the Miami International Autodrome gave him a golden opportunity to move to the top of the standings. However, while Perez led the first half of the race on a medium-hard tyre strategy, Verstappen expertly stretched out his initial stint on hards to rise from P9 to P1 – via a series of fine moves – and he emerged just behind his team mate with a fresh set of mediums late on. With 10 laps remaining, Verstappen comfortably cleared Perez to move into a lead that he would not relinquish, meaning the Mexican had to settle for the runner-up spot and lose some of the ground he had made up in the title race. In addition to a statement victory, Verstappen picked up the fastest lap bonus point to top up his tally and the ‘Driver of the Day’ award, with fans suitably impressed by his charge through the field. With the Red Bulls again in a league of their own, it was left to Fernando Alonso and Aston Martin to claim the ‘best of the rest’ spot in third, making it four podium finishes in five races for the new partnership. George Russell was the lead Mercedes in fourth, thanks in part to team mate Lewis Hamilton moving out of his way on a different strategy earlier in the race, getting the better of Ferrari driver Carlos Sainz in the process. Sainz was hit with a five-second time penalty for speeding in the pits during his swap of tyres, but there was enough of a gap back to Hamilton and team mate Charles Leclerc to keep fifth position at the chequered flag. Alpine bounced back from their Baku nightmare with a double points finish, Pierre Gasly leading home team mate Esteban Ocon, while Haas driver Kevin Magnussen rounded out the points-paying positions after his P4 start. Yuki Tsunoda just missed out on another point in his AlphaTauri, having scored in Australia and Azerbaijan, taking P11 ahead of Aston Martin’s Lance Stroll with some defensive driving to the finish line. Alfa Romeo driver Valtteri Bottas ran inside the points early in the race but dropped back to 13th as the various tyre strategies played out, followed by the Williams of Alex Albon, Haas of Nico Hulkenberg and team mate Zhou Guanyu. McLaren pair Lando Norris and Oscar Piastri had quiet races en route to 17th and 19th respectively, having been the only drivers to start on soft tyres. They were split by the other AlphaTauri of Nyck de Vries, with Williams rookie and home favourite Logan Sargeant bringing up the rear after an early pit stop for a new front wing"
    },
    {
      "id": 6,
      "race": "Emilia Romagna Grand Prix",
      "report": "Following discussions between Formula 1, the President of the FIA, the competent authorities – including the relevant Ministers, the President of the Automobile Club of Italy, the President of Emilia-Romagna Region, the Mayor of the City and the promoter – the decision has been taken not to proceed with the Grand Prix weekend at Imola"
    },
    {
      "id": 7,
      "race": "Monaco Grand Prix",
      "report": "Max Verstappen kept Red Bull’s 2023 winning record intact by overcoming a rain shower – and the chaos that ensued – in the closing stages of the Monaco Grand Prix, leading home Aston Martin rival Fernando Alonso and the Alpine of Esteban Ocon. Verstappen made a clean getaway when the race began to maintain his pole position advantage over Alonso into the first corner, with the Red Bull opting for medium starting tyres and the Aston Martin going for hards But as the race developed and their planned one-and-only stops approached, a rain shower hit the track to turn the encounter on its head, causing a flurry of off-track excursions, brushes with the barriers and pit lane activity. Alonso pitted while only a portion of the track was damp and initially took on mediums, but intensifying rainfall meant he was forced back in for intermediates, which the rest of the field clambered for as well. Crucially, Verstappen went straight from his starting mediums to intermediates, surviving contact with the wall before pitting, getting back into a rhythm in the mixed conditions and controlling proceedings to the chequered flag. Despite that extra stop, Alonso had enough in hand to retain second and score Aston Martin’s best result of the season so far, with Ocon converting his eye-catching qualifying performance into the final podium spot. Mercedes’ updated W14s racked up a solid haul of points as Lewis Hamilton and George Russell took fourth and fifth respectively, the latter’s five-second time penalty for clashing with Sergio Perez when he rejoined the track from an off in the slippery conditions not affecting his finishing position. Home favourite Charles Leclerc crossed the line where he started in sixth, having been given a three-place grid penalty for impeding Lando Norris in qualifying, followed by the other Alpine of Pierre Gasly and Ferrari team mate Carlos Sainz, who lost out with a spin in the wet. Norris and Oscar Piastri gave McLaren a double points finish in ninth and 10th, completing late moves on AlphaTauri rival Yuki Tsunoda, who then tumbled down the order to 15th amid a lock-up and brake complaints. Alfa Romeo wound up 11th and 13th, with Valtteri Bottas and Zhou Guanyu sandwiching the other AlphaTauri of Nyck de Vries, followed by Williams’ Alex Albon, Tsunoda and Perez, who could do no more than 16th after his qualifying crash. Haas’ Nico Hulkenberg endured a messy race en route to 17th, having been given a five-second penalty by the stewards – for hitting Logan Sargeant on Lap 1 – that was not served correctly, resulting in an additional, 10-second sanction. Sargeant was the final finisher following an early-race puncture, with Kevin Magnussen retiring his Haas in the closing laps after being the last driver to ditch slick tyres and visiting the barriers, and Aston Martin’s Lance Stroll the other to DNF after an array of incidents"
    },
    {
      "id": 8,
      "race": "Spain Grand Prix",
      "report": "Red Bull driver Max Verstappen delivered another commanding performance en route to victory in Sunday’s Spanish Grand Prix, leading home the Mercedes machines of Lewis Hamilton and George Russell, with team mate Sergio Perez fourth. Verstappen controlled the race from lights out to the chequered flag to chalk up his fifth win of the 2023 season, and his third triumph at the Circuit de Barcelona-Catalunya, while further increasing his lead in the championship standings Mercedes enjoyed a much-improved display to take a double podium, Hamilton surviving a first-lap clash with McLaren’s Lando Norris and overcoming an early battle with Ferrari’s Carlos Sainz, and Russell working his way up from 12th on the grid with a series of overtakes. Perez put in a solid recovery drive – after starting 11th – to take fourth, just missing out on the final podium spot to Russell after a charging final stint, with Sainz completing the top five, having dropped away from the sharp end as the race developed. Fernando Alonso was unable to add another podium to his, and Aston Martin’s, tally with a quiet run to seventh on home soil, but alongside team mate Lance Stroll’s sixth place, the green machines nonetheless bagged a solid haul of points. After his podium heroics in Monaco, Esteban Ocon had to settle for eighth position this time out, while a five-second time penalty given to Yuki Tsunoda – for forcing Zhou Guanyu off the track – meant the Alfa Romeo driver and the other Alpine of Pierre Gasly rounded out the points. Charles Leclerc also gained a spot from Tsunoda’s sanction but was unable to secure a point after wholesale changes to his Ferrari post-qualifying – and his first Q1 exit since the 2019 Monaco Grand Prix – saw him start from the pit lane. Tsunoda slotted in ahead of McLaren’s Oscar Piastri and AlphaTauri team mate Nyck de Vries, who were the first of the drivers a lap down on Verstappen, followed by Haas’ Nico Hulkenberg and the lead Williams of Alex Albon. Norris was forced to pit for a new front wing after his incident with Hamilton at the start and had a lonely race to 17th, with the other Haas, Alfa Romeo and Williams machines of Kevin Magnussen, Valtteri Bottas and Logan Sargeant bringing up the rear. Verstappen’s win means Red Bull continue their unbeaten start to the campaign, with the reigning double world champion – who also earned the fastest lap bonus – moving 53 points clear of nearest rival Perez in the race for the drivers’ title"
    },
    {
      "id": 9,
      "race": "Canada Grand Prix",
      "report": "Max Verstappen made it six victories from eight races in 2023 with a dominant display during Sunday’s Canadian Grand Prix, leading home the Aston Martin of Fernando Alonso and Mercedes’ Lewis Hamilton, as Red Bull maintained their 100% winning record for the season so far. Verstappen’s lights-to-flag triumph also gave Red Bull their 100th victory in the sport, 18 years on from the team’s debut, while the Dutchman made more history by drawing level with the legendary Ayrton Senna on 41 wins – extending his championship lead in the process. Alonso and Hamilton traded places on multiple occasions throughout the race, Hamilton getting the jump at the start but falling back behind when the strategies unfolded, meaning it was the Spaniard who finished runner-up to the record-setting Verstappen. George Russell missed out on a potential podium fight in the other Mercedes after an early crash caused major damage to his car and dropped him to the foot of the order, with the resulting Safety Car leading to different strategic approaches. Ferrari duo Charles Leclerc and Carlos Sainz were two of only five drivers – along with Red Bull’s Perez, Haas man Kevin Magnussen and Alfa Romeo’s Valtteri Bottas – to stay out under the Safety Car, giving them track position that they converted into P4 and P5 respectively. Perez took a lonely sixth, and the fastest lap bonus point, as he did his best to limit the damage after a third successive compromised qualifying session, while Albon made the most of his top 10 starting spot – and a well-timed single stop under the Safety Car – to give Williams a much-welcomed haul of points in seventh. Albon had to fend off a train of cars in the closing stages of the race that included Alpine’s Esteban Ocon, McLaren’s Lando Norris, the aforementioned Bottas and Aston Martin’s Lance Stroll, benefitting from the upgraded FW45’s strong straight-line speed. Norris would lose his points finish after the chequered flag, though, having been given a five-second penalty for “unsportsmanlike conduct” behind the Safety Car, the McLaren man accused of backing up the pack to clear the way for a McLaren ‘double-stack’ in the pits. That meant Norris dropped to P13, behind team mate Oscar Piastri and the other Alpine of Pierre Gasly, with the final points of the day going to Stroll and Bottas – the Canadian managing to pass the Finn late on to gain an extra place. After dropping from second to fifth on the grid due to his red flag breach in qualifying, Nico Hulkenberg experienced an anonymous afternoon en route to 15th, behind the lead AlphaTauri of Yuki Tsunoda, having lost out with a stop just before the Safety Car and the Haas team’s general lack of competitiveness on race day. Zhou Guanyu was 16th in the second of the Alfa Romeo machines, while Magnussen and AlphaTauri’s Nyck de Vries wound up 17th and 18th respectively after two collisions midway through the race that led to them both running off the track. Having initially continued after his crash and worked his way back into the points, Russell was later told to retire amid brake worries, with Logan Sargeant the other non-finisher when the Williams rookie was asked to park his car in the early stages "
    },
    {
      "id": 10,
      "race": "Austria Grand Prix",
      "report": "Max Verstappen completed a clean sweep of pole positions and race wins at the Austrian Grand Prix with another dominant display in Sunday’s main event, leading home Ferrari driver Charles Leclerc and Red Bull team mate Sergio Perez. Despite an action-packed encounter at the Red Bull Ring that saw several drivers penalised over track limits and strategies differ – Verstappen one of few drivers to stay out during an early Virtual Safety Car period – the Red Bull driver could not be stopped en route to his fifth win on the bounce, and seventh of the season. Leclerc briefly led the way after taking advantage of the VSC, but he fell back behind Verstappen as the pair worked through their opposing tyre plans and the Red Bull showed its raw pace – underlined by a late and successful bid for the fastest lap bonus point. Perez delivered a fine recovery from 15th on the grid to end a difficult run and take his first podium since the Miami Grand Prix four races ago, overhauling Carlos Sainz in the closing stages and making the most of the Ferrari driver’s time penalty for track limits. However, a post-race review by the stewards would later see Sainz handed a 10-second time penalty for track limit violations, promoting Lando Norris to P4, capping off the Briton and McLaren’s encouraging weekend with their batch of upgrades. Sainz was far from the only driver to find themselves penalised following a post-race protest lodged by Aston Martin, however. Logan Sargeant, Nyck de Vries and Yuki Tsunoda would all receive additional five-second penalties, while De Vries again, plus Lewis Hamilton, Alex Albon and Pierre Gasly were all handed 10-second time penalties post-race. Esteban Ocon, meanwhile, was retrospectively handed a pair of five-second penalties and a pair of 10-second penalties. That left the order behind Norris in P4 as Fernando Alonso in fifth, with Sainz sixth, followed by the Mercedes pair of George Russell and Lewis Hamilton in seventh and eighth. Lance Stroll was promoted a place from the provisional classification to claim ninth, ahead of Gasly in 10th and Albon in 11th. The penalties promoted Zhou Guanyu to 12th (up from 14th at the flag), ahead of Sargeant, Ocon, and Valtteri Bottas in P15. Oscar Piastri, De Vries, Kevin Magnussen and Yuki Tsunoda rounded out the order. Haas’s strong start to the event ended with the disappointment of a retirement for Nico Hulkenberg, whose loss of power forced him to park at the side of the track, triggering a Virtual Safety Car"
    },
    {
      "id": 11,
      "race": "Great Britain Grand Prix",
      "report": "Red Bull’s Max Verstappen overcame an early attack from McLaren rival Lando Norris to triumph in an action-packed British Grand Prix, marking his first-ever victory at this event and extending his current winning run to six races. Norris jumped Verstappen for the lead at the start, with team mate Oscar Piastri almost following him through, meaning it was a Red Bull in a McLaren sandwich over the first few laps – but the reigning double world champion soon fought back.By Lap 5, and with DRS at his disposal, Verstappen reclaimed P1 from Norris and never looked troubled, pulling away from the home favourite as the race developed and then managing a late Safety Car period – caused by Kevin Magnussen’s smoking Haas – that saw the leaders go for different tyre strategies. While the majority of the front-runners chose soft tyres under the Safety Car, Norris went for hards, meaning he had to pull off some impressive defending to remain P2 over fellow Briton Lewis Hamilton, who jumped Piastri when the race was neutralised.Piastri had held third for the majority of the 52-lap encounter, only to pit just before the aforementioned Safety Car, but fourth – a couple of seconds up on the other Mercedes of George Russell – still represented the best result of the Australian rookie’s burgeoning F1 career.Sergio Perez delivered another solid recovery drive to sixth after the Red Bull driver’s latest qualifying woes, making a series of late moves to finish ahead of Aston Martin’s Fernando Alonso, Williams’ Alex Albon and the Ferraris of Charles Leclerc and Carlos Sainz.Williams almost had two cars in the points on home soil, with Logan Sargeant a personal best 11th, followed by the Alfa Romeo of Valtteri Bottas, who started at the back after being excluded from qualifying, and Nico Hulkenberg, who dropped to the rear early on when he picked up front wing damage on his Haas.Lance Stroll wound up 14th after being penalised for causing a collision with Pierre Gasly, who was forced to retire thereafter, joining team mate Esteban Ocon, who pitted early on amid apparent technical trouble – and Magnussen on the sidelines.Zhou Guanyu was 15th in the other Alfa Romeo, having made three pit stops (one more than anyone else), with AlphaTauri pair Yuki Tsunoda and Nyck de Vries the final drivers to cross the line after Gasly’s aforementioned dramas.After the chequered flag, there was no hiding Verstappen’s excitement as he not only moved 99 points clear of Perez in the drivers’ standings, but also gave Red Bull a record-equalling 11th successive F1 win"
    },
    {
      "id": 12,
      "race": "Hungary Grand Prix",
      "report": "Max Verstappen stormed to victory over Lando Norris and Sergio Perez with another commanding performance in the Hungarian Grand Prix, giving the reigning double world champion his seventh straight triumph and the Red Bull their 12th in a row – beating McLaren’s long-standing record. Verstappen passed pole-sitting Mercedes rival Lewis Hamilton at the start before settling into the lead and pulling clear of the chasing pack with aplomb, chalking up a lights-to-flag win that puts further distance between himself and team mate Perez in the drivers’ standings. It means Red Bull continue their 100% winning run for the 2023 season, while setting a new outright milestone in terms of successive race wins, with their staggering tally now one clear of the 11 McLaren achieved with Ayrton Senna and Alain Prost during the 1988 campaign. Verstappen took the chequered flag comfortably clear of Norris, who dropped behind fellow McLaren driver Oscar Piastri early on but regained the place at the first round of pit stops, while Perez – one of only two drivers, along with George Russell, to go long in the first stint on hard tyres – rose from ninth to third with another strong recovery drive. Hamilton’s hopes of turning his 104th pole into a 104th win were dashed at the start when he lost out to Verstappen, Piastri and Norris in quick succession, before that was compounded when he fell victim to Perez’s alternate strategy, but the seven-time champion at least salvaged fourth via a late move on the Australian rookie Piastri. Charles Leclerc crossed the line in sixth position but dropped behind the other Mercedes of Russell – who battled his way from 18th – after the chequered flag when a five-second penalty for speeding in the pit lane was applied, with Ferrari team mate Carlos Sainz coming home eighth. Aston Martin ended an anonymous race weekend with a minor double points finish, Fernando Alonso the last driver to stay on the same lap as winner Verstappen in ninth and team mate Stroll finishing one tour down in 10th to round out the points. Fresh from their recent points-scoring exploits, Alex Albon and Williams had to settle for 11th this time out, followed by the lead Alfa Romeo of Valtteri Bottas in 12th after the Hinwil team’s high-flying qualifying display turned sour on race day through incidents and a general lack of pace. Indeed, Zhou Guanyu’s fifth-place starting position became a lowly 16th on race day after he tried to make up for a slow getaway and ran into F1 returnee Daniel Ricciardo at the start, triggering a four-car collision that led to both Alpine drivers retiring from proceedings once again. Ricciardo recovered to take 13th in his first race back since the 2022 season finale in Abu Dhabi, ahead of Haas driver Nico Hulkenberg, AlphaTauri team mate Yuki Tsunoda, the aforementioned Zhou and final finisher Kevin Magnussen. Williams rookie Logan Sargeant pulled into the pits after a late spin, with Esteban Ocon and Pierre Gasly doing the same in the early stages due to the significant damage their cars picked up in the chaos sparked by Zhou. With the penultimate round before the summer break completed, Verstappen now holds a 110-point lead over Perez in the 2023 title race, having also claimed the bonus point on offer for posting the fastest tour of the 70-lap encounter"
    },
    {
      "id": 13,
      "race": "Belgium Grand Prix",
      "report": "Max Verstappen recovered from a five-place gearbox penalty to claim his eighth successive victory in Sunday’s Belgian Grand Prix, with team mate Sergio Perez adding to the celebrations for Red Bull as he completed a one-two result. Verstappen gradually picked off his rivals across a tense 44-lap encounter at Spa-Francorchamps, taking P1 after Ferrari driver Charles Leclerc had started the race on pole. The championship leader then kept his car on the track during a mid-race shower that threatened to – but did not quite force – a move from slick tyres to intermediates. Perez also worked his way past Leclerc to come home in the runner-up spot, crossing the line some 20 seconds behind Verstappen and giving Red Bull their first perfect result since the Miami Grand Prix back in May. Leclerc held on for the final podium position, denying seven-time world champion Lewis Hamilton (who pitted late on to net the fastest lap), while Fernando Alonso put his Aston Martin ahead of the other Mercedes machine of George Russell to take fifth. Lando Norris initially lost a host of positions after starting the race on medium tyres and then switching to hards, but a move to softs as spits of rain began to fall proved inspired and he gobbled up the competition on his grippy rubber and eventually bagged seventh. Aston Martin secured another double points finish as Lance Stroll backed up team mate Alonso in ninth, while Esteban Ocon and Yuki Tsunoda completed the points in eighth and 10th respectively via some late scrapping. Pierre Gasly went longer into the race than anyone else with a sizeable first stint, but a slow stop when he eventually boxed hindered his efforts and left him 11th at the chequered flag, followed by the Alfa Romeos of Valtteri Bottas and Zhou Guanyu. Williams had mixed it in the points-paying places early on, with the FW45 showing incredible straight-line speed, but they faded as the different slick-tyre strategies played out, leaving Alex Albon 14th and Logan Sargeant 17th. SPA, BELGIUM - JULY 30: Max Verstappen of the Netherlands driving the (1) Oracle Red Bull Racing Haas duo Kevin Magnussen and Nico Hulkenberg, both impacted by pre-race penalties, wound up 15th and 18th respectively, while 16th went to the second AlphaTauri of Daniel Ricciardo, who could not match team mate Tsunoda’s points-scoring efforts. Only 18 cars finished the race after a first-corner clash between Sprint podium finisher Oscar Piastri and Carlos Sainz led to both drivers retiring – the McLaren man clipping the inside wall at La Source and stopping at the side of the track, and the Ferrari nursing damage before being called in to retire. When the drivers returned to parc ferme, Verstappen could not hide his delight as he punched the air in celebration for the 10th time this season, moving just one win away from matching Sebastian Vettel’s successive victory record of nine races in the process. It also means Verstappen now holds a lead of 125 points over Perez in the drivers’ standings, as the Dutchman continues his push towards what would be a third world championship on the bounce"
    },
    {
      "id": 14,
      "race": "Netherlands Grand Prix",
      "report": "Max Verstappen converted pole position into victory at the Dutch Grand Prix for the third year in a row, navigating an action-packed, rain-hit encounter to take the chequered flag ahead of Fernando Alonso and Pierre Gasly and draw level with Sebastian Vettel on nine successive F1 wins. It all began with spits of rain before the start of the race that dramatically turned into a shower on the first lap, prompting split strategies up and down the order as Verstappen headed a pack of drivers who initially stayed out on slicks and team mate Perez led a group into the pits to take on intermediates. What followed was a frenetic opening phase as those who made an early switch to intermediates rose to the fore, while those who stayed out longer on slicks lost a hatful of positions, prior to the rain easing off and the track gradually drying up. With the Red Bulls running those aforementioned alternate strategies, it was Perez who led the way as the race settled down, while Verstappen had fallen back to fourth – behind Zhou Guanyu and Gasly – and had work to do to reclaim P1. After managing to do so with much superior pace, Verstappen looked set for a clear run to the chequered flag and the win on a bone-dry track, only for further rain to work its way onto the radar and hit the track with force in the closing stages. That led to another flurry of pit lane activity, and a red flag after Zhou crashed out, bringing a seven-lap dash to the flag when the action resumed and serving up one last test for reigning double world champion Verstappen to overcome. Overcome it Verstappen did as he kept his cool at the slippery restart and managed the gap back to Alonso and Perez with aplomb, confirming his hard-fought triumph and equalling Vettel’s victory record that has stood since the 2013 season. Alonso’s second-place finish marked his first podium since Canada more than two months ago, while Perez crossed the line in third but was hit with a five-second time penalty for speeding in the pit lane, promoting a delighted Gasly – who had started 12th – to the rostrum. Perez had to settle for fourth after his sanction, followed by the Ferrari of Carlos Sainz and Mercedes of Lewis Hamilton, who were involved in a late, wheel-banging scrap, as Lando Norris, Alex Albon, Oscar Piastri and Esteban Ocon completed the points. Lance Stroll just missed out on a top-10 finish in the other Aston Martin, followed by Nico Hulkenberg, F1 newcomer Liam Lawson and Kevin Magnussen – the AlphaTauri driver given a 10-second penalty for impeding the Dane in the pit lane. That moment aside, it was a strong debut performance for the 21-year-old New Zealander, who otherwise stayed out of trouble and kept his car on the track, finishing three spots up on team mate Yuki Tsunoda, who took a five-second penalty of his own for causing a collision with George Russell. Valtteri Bottas was the only Alfa Romeo to finish after Zhou’s crash, taking 15th from Tsunoda and Russell, the latter losing what would have been a points finish after contact with Norris during the final dash to the flag.Joining Zhou on the sidelines were Charles Leclerc due to damage picked up on the first lap that ultimately proved too challenging to race on with, and Logan Sargeant, who followed up his qualifying crash with another heavy shunt"
    },
    {
      "id": 15,
      "race": "Italy Grand Prix",
      "report": "Max Verstappen and Red Bull came out on top in a battle against the Ferraris to secure victory in Sunday’s Italian Grand Prix and make more F1 history – the Dutchman moving ahead of Sebastian Vettel with 10 wins on the bounce and the team stretching their winning run to 15 races. Verstappen slotted behind the pole-sitting Carlos Sainz at the start but hounded his rival as the opening stint wore on, eventually forcing the Ferrari driver into a mistake at the first chicane on Lap 15 and then sweeping past around the outside of the Curva Grande. From there, the reigning double world champion never looked back, pulling out a comfortable advantage up front for his latest F1 record as Sainz, team mate Sergio Perez and the other Ferrari of Charles Leclerc fought over the remaining podium positions. After an action-packed finale and some fierce defending from Sainz, it was Perez who emerged with the runner-up spot behind Verstappen, giving Red Bull their sixth one-two finish of the season as they turned the tables on Ferrari at the famous marque’s home track. Sainz and Leclerc sent heart rates racing at the Scuderia as they went wheel-to-wheel over third all the way to the chequered flag – a huge lock-up from the Monegasque into the first chicane on the last lap settling the scrap in his team mate’s favour. Behind the drama at the front, Mercedes logged a solid double points finish as George Russell and Lewis Hamilton came home fifth and sixth respectively, despite both drivers being hit with five-second time penalties. Russell took his for leaving the track and gaining an advantage at the first chicane in a fight with Alpine driver Esteban Ocon, while Hamilton – who used a different tyre strategy to make up ground late on – took his for a clash with McLaren’s Oscar Piastri at the second chicane. Alex Albon gave Williams some more points in seventh, defending from the other McLaren of Lando Norris in a race to the finish line, as the Aston Martin of Fernando Alonso and Alfa Romeo of Valtteri Bottas completed the top 10. Liam Lawson finished on the brink of the points in his second appearance in place of Daniel Ricciardo at AlphaTauri, with Piastri 12th after the incident involving Hamilton and a five-second penalty for leaving the track and gaining an advantage. Williams rookie Logan Sargeant was left to rue his own coming together with Bottas – and a five-second time penalty for causing that collision – en route to 13th, followed by the other Alfa Romeo of Zhou Guanyu and Pierre Gasly’s Alpine. It was a quiet afternoon for Aston Martin’s Lance Stroll after his back-of-the grid start, the Canadian taking 16th at the chequered flag from the Haas machines of Nico Hulkenberg and Kevin Magnussen, who had another challenging race day. Two drivers failed to make it to the finish, with Ocon retiring late on in the second of the Alpines and Yuki Tsunoda watching the action from the sidelines after a reported engine failure on the formation lap put his AlphaTauri out before the race had even started"
    },
    {
      "id": 16,
      "race": "Singapore Grand Prix",
      "report": "Carlos Sainz converted pole position into a second career victory as the Spaniard held off the charge of Lando Norris and the Mercedes pair of Lewis Hamilton and George Russell – who crashed on the final lap – to take a well-earned win at the Singapore Grand Prix – the first non-Red Bull win of the season. Sainz kept a hold of the lead at the start but with Charles Leclerc having opted to start on the softs, as opposed to those around him on the mediums, the Monegasque was able to jump ahead of Russell for second place. He then navigated a Safety Car – caused by Logan Sargeant crashing into the barrier – to keep a hold of the lead, as he later held off the challenge of Russell, Norris, and Hamilton. But after Esteban Ocon – running in sixth at the time – stopped on track with a suspected gearbox issue, Mercedes used the Virtual Safety Car to stop their drivers for some new medium tyres, setting up a grandstand finish.   But despite Russell and Hamilton getting past Leclerc, they could not overtake Sainz and Norris, with the Spaniard gifting his former McLaren team mate some DRS in the closing stages to hold of the Silver Arrows pair, and sealing a second career win. Russell’s hopes of a podium ended in the barrier at Turn 10 on the final lap as he looked to get past Norris for second, allowing the McLaren driver to take his third podium finish of the season, while Hamilton took third place. Leclerc was able to hold off the fast-charging Max Verstappen for fourth at the end, with the Red Bull driver recovering from a difficult outing, that at one stage saw him being overtaken by the leading drivers for the first time this season, to take fifth. Pierre Gasly was an impressive sixth for Alpine, while Oscar Piastri took seventh for McLaren. Sergio Perez ended up eighth – although he is being investigated for his part in a collision with Alex Albon. Liam Lawson scored the first points of his short F1 career for AlphaTauri as he took ninth, ahead of the lead Haas of Kevin Magnussen. Alex Albon wound up 11th for Williams, ahead of Alfa Romeo’s Zhou Guanyu, and the other Haas of Nico Hulkenberg. Both Sargeant and Fernando Alonso had their fair share of incidents in the race as the latter had a five-second penalty, a slow pit stop, and went off track to finish last of the remaining runners behind the American rookie in 14th. Russell’s crash at the end meant he, alongside Valtteri Bottas, Yuki Tsunoda – who sustained a puncture in the opening lap of the race – and Ocon did not finish the race"
    },
    {
      "id": 17,
      "race": "Japan Grand Prix",
      "report": "Max Verstappen and Red Bull returned to winning ways in Sunday’s Japanese Grand Prix after surviving a dramatic first lap and pulling comfortably clear of McLaren pair Lando Norris and Oscar Piastri, confirming another constructors’ title for the Milton Keynes team. Verstappen was attacked by Piastri and Norris at the start but kept both of them at bay, navigated Safety Car and Virtual Safety Car periods and then romped into the distance, taking the chequered flag first for the 13th time this season. As such, Red Bull mathematically put the constructors’ championship out of their rivals’ reach to back up their 2022 win and make it two triumphs on the bounce, underlining the outfit’s superiority under F1’s latest ground effect era so far, while adding to the teams’ titles they achieved in 2010, 2011, 2012 and 2013. A battle between the McLaren drivers was ultimately settled in Norris’ favour, the Briton getting ahead at the start, dropping behind when Piastri pitted under a Virtual Safety Car but then displaying enough pace for the team to swap positions. Charles Leclerc led Ferrari’s charge in fourth position, completing a bold, late move on Mercedes rival George Russell – the only front-runner to attempt a one-stop rather than two-stop strategy – around the outside of Turns 1 and 2. Russell fell into the clutches of team mate Lewis Hamilton in the closing laps and was instructed to let him by, which he agreed to do, after the Mercedes drivers had gone wheel-to-wheel and almost collided earlier in the race. Carlos Sainz also pounced on Russell’s ageing tyres to take sixth behind Hamilton, with Aston Martin’s Fernando Alonso and the Alpines of Esteban Ocon and Pierre Gasly – despite a first-lap incident for the former – scoring the final points of the day. With their cars starting ninth and 11th, AlphaTauri had been points contenders in the opening exchanges, but faded as the various strategies played out – F1 newcomer Liam Lawson beating home favourite Yuki Tsunoda to the flag in 11th and 12th respectively. Zhou Guanyu was another to bounce back from Lap 1 drama as he crossed the line 13th, the only Alfa Romeo driver to finish after team mate Valtteri Bottas was punted into the gravel by Williams rival Logan Sargeant. Haas pair Nico Hulkenberg and Kevin Magnussen were the final finishers in P14 and P15 respectively, a theme of their 2023 season amid tyre degradation struggles, with a gaggle of cars behind retiring at different stages. Williams suffered a double DNF as Sargeant returned his car to the garage after clashing with Bottas, having been penalised pre-race and given a pit lane start for major car changes following his qualifying crash, while Albon retired with damage after his own Lap 1 incident involving the Alfa Romeo. Another bottleneck moment at the start saw Red Bull’s Sergio Perez bang wheels with Hamilton, before a separate incident with Magnussen forced him to pit for a second new front wing, leading to his retirement (albeit reappearing late on to serve time penalties). Lance Stroll was the other driver to retire with a rear wing issue on his Aston Martin"
    },
    {
      "id": 18,
      "race": "Qatar Grand Prix",
      "report": "Red Bull driver Max Verstappen continued his title celebrations with a dominant performance during Sunday’s Qatar Grand Prix, leading home the McLarens of Oscar Piastri and Lando Norris following a first-lap collision between Mercedes pair Lewis Hamilton and George Russell. Hamilton and Russell went wheel-to-wheel moments after the lights went out at the Lusail International Circuit, the seven-time world champion attempting to go around the outside of his team mate through Turn 1, only for the duo to dramatically make contact in the bottleneck. With Hamilton out of the race on the spot, and Russell forced to pit for a new front wing at the end of the opening lap, two of Verstappen’s main rivals had already fallen by the wayside and the now triple world champion never looked back, romping to win number 14 of 2023. McLaren backed up an impressive Sprint race display as Piastri and Norris came home second and third respectively for another double podium finish, rising from their P6 and P10 grid slots after losing lap times over track limits violations in qualifying. Russell put in a fine recovery drive to take fourth at the chequered flag, getting the better of Ferrari’s Charles Leclerc and Aston Martin’s Fernando Alonso, who was hindered by an off-track excursion and an overheating seat. Esteban Ocon came home seventh for Alpine, while Alfa Romeo logged their first double points finish of the season as Valtteri Bottas and Zhou Guanyu took P8 and P9, ahead of the other Red Bull of Sergio Perez. Perez made the points despite starting from the pit lane thanks to major car changes in the wake of his Sprint race accident, and an action-packed evening that saw him pick up three penalties for exceeding track limits. Lance Stroll (Aston Martin) had crossed the line in the points-paying positions but dropped to 11th after the chequered flag for his own track limits violations, with Pierre Gasly (Alpine) and Alex Albon (Williams) also penalised in P12 and P13. Haas drivers Kevin Magnussen and Nico Hulkenberg and AlphaTauri pair Yuki Tsunoda and Liam Lawson were the final drivers to make it to the finish in a race that saw the entire field complete at least three pit stops due to tyre-related safety measures. Hamilton watched from the sidelines following his clash with Russell, while Logan Sargeant retired in the other Williams during the closing stages after reporting that he was feeling unwell at the wheel amid the intense heat. Before the race had even started, Carlos Sainz was ruled out of proceedings due to a fuel system problem developing on his car that could not be resolved in time, meaning Leclerc was the sole Ferrari driver in action"
    },
    {
      "id": 19,
      "race": "USA Grand Prix",
      "report": "Max Verstappen recovered from sixth on the grid to take a nerve-wracking win at the United States Grand Prix, as the Red Bull man held off a fast-approaching Lewis Hamilton and the McLaren of Lando Norris to claim his 50th Formula 1 race win. After a quiet start, Verstappen gradually picked off his rivals one by one in what was a tense Austin affair. He took the lead from Norris, who had earlier taken first place on the opening lap ahead of pole-sitter Charles Leclerc. Hamilton, on new mediums, chased down Norris for second with a few laps to go and looked to close in on Verstappen for the win – in a reverse scenario of what happened in last year’s race where Verstappen chased down Hamilton for the win – but to no avail as he settled for second. Norris held off the late advances of Carlos Sainz to take his fourth podium in a row, ahead of the other Red Bull of Sergio Perez, who overtook a very frustrated Leclerc late in the event to finish fifth. Leclerc ended up sixth for Ferrari, with George Russell in seventh, as the Alpine of Pierre Gasly came home an impressive eighth. Lance Stroll recovered from a pit lane start to finish ninth for Aston Martin, as Yuki Tsunoda rounded out the top-10 – while also claiming a valuable point for AlphaTauri in the form of a fastest lap. Alex Albon’s five-second time penalty for exceeding track limits did not cost him a position as he finished 11th, although he will be investigated after the race for multiple breaches of the same offence. The Thai racer was followed by his Williams team mate, Logan Sargeant, in 12th. Nico Hulkenberg was the lead Haas on the day as he finished 13th, ahead of the Alfa Romeos of Valtteri Bottas and Zhou Guanyu, with his team mate, Kevin Magnussen down in 16th. The returning Daniel Ricciardo was the last of the remaining runners for AlphaTauri. There were three drivers who failed to see the chequered flag as Fernando Alonso, Oscar Piastri, and Esteban Ocon all retired from the race due to issues with their respective cars"
    },
    {
      "id": 20,
      "race": "Mexico Grand Prix",
      "report": "Max Verstappen scored a dominant victory at this weekend’s Mexico City Grand Prix, taking the lead at the start of the race to finish ahead of Lewis Hamilton, as he sealed his fifth win at the Autodromo Hermanos Rodriguez – and his 16th victory of the season. Verstappen lined up in third but made a phenomenal start using the tow from pole-sitter Charles Leclerc as he took the lead into Turn 1. However, at the same corner, Leclerc collided with the fast-starting Sergio Perez, knocking the home favourite out of the race. Leclerc was in second ahead of Lewis Hamilton and Carlos Sainz, when Kevin Magnussen crashed into the barrier at Turn 8 halfway through. The Dane was okay as he jumped out of the car but the resulting damage to his car and the barrier forced the red flags to be waved. At the subsequent restart, Verstappen kept a hold of the lead, with Hamilton – on the mediums – overtaking Leclerc for second a few laps later. The Briton held on to the position, with Leclerc taking the final spot on the podium ahead of Sainz. Lando Norris had an outstanding recovery drive from 17th on the grid, as he overtook George Russell late in the affair to take fifth place. The Mercedes driver then held off the late charge of Daniel Ricciardo, who marked an impressive weekend for him and AlphaTauri to take seventh. The other McLaren of Oscar Piastri survived a collision with Yuki Tsunoda to finish eighth. He took the chequered flag ahead of Alex Albon, who continued to impress for Williams, with Esteban Ocon overtaking Nico Hulkenberg late in the piece to take 10th for Alpine. Pierre Gasly followed home his Alpine team mate in 11th, ahead of the AlphaTauri of Tsunoda – who recovered from his collision with Piastri to finish 12th – and the Haas of Hulkenberg. Valtteri Bottas, who is under investigation for colliding with Stroll in the stadium section, finished 14th ahead of his Alfa Romeo team mate Zhou Guanyu in 15th – who was the last of the remaining runners. Logan Sargeant retired on his final lap, and he was amongst five other drivers who failed to see the chequered flag. The others were Stroll, Magnussen, Fernando Alonso, and home favourite Perez"
    },
    {
      "id": 21,
      "race": "Brazil Grand Prix",
      "report": "Max Verstappen put in an assured drive to take a dominant victory in the Sao Paulo Grand Prix, making it a record-breaking 17th win for the world champion in 2023. There was drama even before the race had got under way when Charles Leclerc went off on the formation lap after losing the hydraulics, forcing him to retire. When the lights went out, Verstappen made a clean start into the lead, but a heavy collision between Alex Albon and Kevin Magnussen behind resulted in the red flags being thrown. It was another strong getaway from Verstappen at the restart, who resisted a challenge from Norris to hold P1 before going on to clinch his second win of the weekend after coming out on top in Saturday’s Sprint. Norris claimed a solid second place, while Alonso completed the podium after holding off Sergio Perez in a thrilling battle to the line. Lance Stroll added to Aston Martin’s tally by taking fifth, ahead of the sole Ferrari runner of Carlos Sainz in sixth. Pierre Gasly was the lead Alpine in seventh, while Lewis Hamilton ended a tough day for Mercedes in P8. Yuki Tsunoda and Esteban Ocon rounded out the top 10. Logan Sargeant just missed out on points in P11 and Nico Hulkenberg ended up in 12th, with both drivers running solo for their respective teams. Daniel Ricciardo and Oscar Piastri were the last of those to cross the line in P13 and P14. The Australian pair had each suffered damage in the first-corner incident but were able to have their cars repaired during the red flag period. There were several retirements from the race, with George Russell forced to pit owing to an oil temperature issue after a challenging afternoon, while the Alfa Romeo duo of Valtteri Bottas and Zhou Guanyu both recorded a DNF due to technical problems. Magnussen and Albon were out following their first-lap crash, while Leclerc also recorded a DNF due to his formation lap exit"
    },
    {
      "id": 22,
      "race": "Las Vegas Grand Prix",
      "report": "Max Verstappen emerged on top at the end of an action-packed Las Vegas Grand Prix, beating Ferrari rival Charles Leclerc and Red Bull team mate Sergio Perez to the chequered flag in a race punctuated by several incidents and Safety Car periods. Verstappen took the lead from Leclerc at the start of the race but was promptly handed a five-second time penalty for forcing his rival off the track and then got overtaken by the pole-sitter before serving it at the first round of pit stops. Leclerc went longer into the race before changing tyres in an opening stint dominated by graining concerns, only for a Safety Car shortly afterwards to allow Verstappen and several other drivers to pit again under caution. At the decisive restart, Leclerc initially controlled proceedings from Perez, who had benefitted from an early stop after an incident on the first lap, though ageing tyres meant he came under severe pressure. Verstappen lit up the timesheets in the final laps to clear both his team mate and the leading Ferrari for a landmark win in the City of Lights, while Perez had followed him through to form a one-two, only to be re-passed by a determined Leclerc on the final lap. Behind, a remarkable rise from Esteban Ocon netted fourth place for himself and Alpine, despite being narrowly beaten by Mercedes’ George Russell to the line. However, Russell had been carrying a five-second time penalty for a clash with Verstappen that brought out the aforementioned Safety Car. Russell’s penalty also promoted the Aston Martin of Lance Stroll to fifth, while Ferrari driver Carlos Sainz and the sister Mercedes of Lewis Hamilton – who clashed at Turn 1 – also benefitted to take sixth and seventh positions. Fernando Alonso and Oscar Piastri completed the points in their respective Aston Martin and McLaren machines, the Spaniard recovering from a Lap 1 spin and the Australian rookie the only papaya car to make it to the flag after team mate Lando Norris suffered a heavy crash early on. Pierre Gasly had held points for the majority of the race after starting up in fourth, but a tumble down the order for the Alpine saw him cross the line in 11th, with Alex Albon suffering a similar fate in his Williams. Kevin Magnussen and Daniel Ricciardo had lonely races en route to P13 and P14 for Haas and AlphaTauri, with the Alfa Romeos of Zhou Gaunyu and Valtteri Bottas – the latter another caught out at Turn 1 – and Williams rookie Logan Sargeant among the final finishers. AlphaTauri’s Yuki Tsunoda and Haas’ Nico Hulkenberg both pulled off the track in the closing stages amid apparent technical trouble, meaning they joined Norris on the list of retirements and watched the finish from the sidelines. After a spectacular three days of action under the lights in Las Vegas, F1 will move swiftly on to the Yas Marina Circuit for the season-ending Abu Dhabi Grand Prix next weekend"
    },
    {
      "id": 23,
      "race": "Abu Dhabi Grand Prix",
      "report": "Max Verstappen confidently converted pole position into victory during Sunday evening’s season-ending Abu Dhabi Grand Prix, making it 19 wins across 22 races in what has been a remarkable year for the Dutchman and his Red Bull team. Verstappen defended from Charles Leclerc on the run to the first corner and across the first lap before cementing his lead and gradually pulling clear, taking the chequered flag comfortably ahead of the chasing pack as the sun set on the 2023 campaign. Sergio Perez crossed the line in second position for Red Bull, but a five-second time penalty for a clash with McLaren’s Lando Norris demoted him to fourth when the results were confirmed, leaving Leclerc second and the Mercedes of George Russell third. Leclerc had been second on the road until the closing laps when he elected to let Perez pass him and try to generate enough of a gap between the Red Bull and Russell to boost Ferrari’s chances of beating Mercedes to second in the constructors’ standings, but it was not to be. Norris had to settle for fifth after his run-in with Perez, the position he started thanks to his costly qualifying mistake, with team mate Oscar Piastri taking sixth from the Aston Martin of Fernando Alonso and AlphaTauri’s Yuki Tsunoda. Lewis Hamilton and Lance Stroll made it double points finishes for their respective Mercedes and Aston Martin teams, with Daniel Ricciardo missing out by half a second in team boss Franz Tost’s final race overseeing the AlphaTauri squad. Alpine pair Esteban Ocon and Pierre Gasly went unrewarded in the final race of the season, the latter having been involved in a brush of bodywork with Hamilton midway through proceedings, followed by the lead Williams of Alex Albon. Nico Hulkenberg could not convert his Q3 appearance into points for Haas, dropping all the way down to 15th position in another challenging race, with Williams rookie Logan Sargeant and the Alfa Romeo of Zhou Guanyu coming home 16th and 17th respectively. Carlos Sainz had been running in the points in the closing stages, but his alternative strategy required a late pit stop and left him a lowly 18th, as Valtteri Bottas and Kevin Magnussen completed the order for Alfa Romeo and Haas"
    },
    {
      "race": "Bahrain Grand Prix",
      "report": "Red Bull enjoyed a perfect start to the season in the 2023 Bahrain Grand Prix as Max Verstappen cruised to victory over team mate Sergio Perez – while Fernando Alonso finished third as Charles Leclerc retired from the race.Everyone bar hard-shod Kevin Magnussen (P15) began the race on soft tyres and Verstappen had a solid getaway, but team mate Perez fell back and lost second place to Leclerc – while Carlos Sainz couldn’t quite pry P3 off the Red Bull. The reigning champion stretched his legs in the lead and eventually won by more than 10 seconds. Perez completed the one-two with both Red Bull drivers on similar soft-soft-hard strategies. Aston Martin’s hopes of crashing the podium fight seemed to have come crashing down on Lap 1 when Lance Stroll made a lunge on team mate That was just after Alonso produced an absolutely brilliant move to take P5 off Lewis Hamilton, down the inside of Turn 10. Alonso went on the warpath and on Lap 45 he passed Sainz after a stunning battle through Sector 2, to seal his first podium since Qatar 2021. Sainz therefore settled for fourth, fending off a brief attack from Hamilton, who ended up fifth on the board. As for Stroll, he was perhaps relieved not to get a penalty for hitting his team mate on Lap 1, and perhaps more relieved to see Alonso finish on the podium. The Canadian made an admirable recovery from his wrist injury, however, and finished sixth between the Mercedes – as George Russell was undercut by the Aston Martin in the second pit stops and finished seventh. Valtteri Bottas capitalised on poor starts for his rivals and finished a solid eighth for Alfa Romeo, while Pierre Gasly recovered from P20 for Alpine, pitting three times, to finish ninth. Alex Albon finished 10th for Williams after a great start, while Yuki Tsunoda narrowly missed out on the final point in his AlphaTauri. Rookie Logan Sargeant battled with Alfa Romeo’s Zhou Guanyu to take 12th on debut, while Zhou pitted on the penultimate lap of the race to promote Kevin Magnussen – whose hard-hard-soft gambit didn’t yield points – to P13. Nyck de Vries took P14 on his AlphaTauri debut, leaving Nico Hulkenberg 15th with a five-second penalty. Zhou was classified 16th for Alfa Romeo, and Lando Norris endured a tough race, a slow pit stop seeing him barrel down the order. A last-lap pit stop for softs saw the McLaren driver round out the standings. Esteban Ocon had a calamitous start to the season for Alpine, copping a five-second penalty for lining up on his grid slot incorrectly, a further 10-second penalty for serving that penalty incorrectly, and another five seconds for speeding in the pit lane. Alpine decided to retire him late on.Leclerc was incredulous when he retired on Lap 41, and Oscar Piastri’s debut ended after just 13 laps when he pulled into the McLaren pits with an electrical issue.Alonso, meanwhile, was jubilant to take his first podium in over a year.And it was a perfect start to 2023 for Red Bull – but things can change. Just last year, both Red Bulls retired from the opening race of the season Alonso into Turn 4 and hit the rear-right of his car, allowing both Mercedes ahead. Ferrari’s hopes of the podium did however come crashing down on Lap 41, when Leclerc retired with an engine issue. ",
      "id": 24
    }
  ],
  "user": [
    {
      "email": "secavajugu@mailinator.com",
      "username": "sywozesuzy",
      "password": "Pa$$w0rd!",
      "role": "User",
      "id": 1
    },
    {
      "email": "admin@admin.com",
      "username": "adimn",
      "password": "adimna123",
      "role": "Admin",
      "id": 2
    },
    {
      "email": "admin@admin.com",
      "username": "user",
      "password": "user123",
      "role": "User",
      "id": 3
    },
    {
      "email": "pecuvy@mailinator.com",
      "username": "woqud",
      "password": "Pa$$w0rd!",
      "role": "User",
      "id": 4
    },
    {
      "email": "hide@mailinator.com",
      "username": "qosyhif",
      "password": "Pa$$w0rd!",
      "role": "User",
      "id": 5
    },
    {
      "email": "zepy@mailinator.com",
      "username": "zaveluji",
      "password": "Pa$$w0rd!",
      "role": "User",
      "id": 6
    },
    {
      "email": "jagypy@mailinator.com",
      "username": "zabubakav",
      "password": "Pa$$w0rd!",
      "role": "User",
      "id": 7
    },
    {
      "email": "dfsf@dsf.com",
      "username": "blabla",
      "password": "bla123",
      "role": "User",
      "id": 8
    }
  ],
  "quiz": [
    {
      "question": "Who is the driver with the most Formula 1 World Championships?",
      "options": [
        "Michael Schumacher",
        "Lewis Hamilton",
        "Ayrton Senna",
        "Sebastian Vettel"
      ],
      "correctAnswer": "Lewis Hamilton"
    },
    {
      "question": "In which year did Formula 1 have its first World Championship?",
      "options": [
        "1949",
        "1950",
        "1951",
        "1952"
      ],
      "correctAnswer": "1950"
    },
    {
      "question": "Which team has won the most Constructors' Championships in Formula 1 history?",
      "options": [
        "Ferrari",
        "Mercedes",
        "McLaren",
        "Williams"
      ],
      "correctAnswer": "Ferrari"
    },
    {
      "question": "Who was the first driver to win the World Championship for Mercedes after their return in 2010?",
      "options": [
        "Nico Rosberg",
        "Lewis Hamilton",
        "Michael Schumacher",
        "Valtteri Bottas"
      ],
      "correctAnswer": "Lewis Hamilton"
    },
    {
      "question": "Which Formula 1 track is known as 'The Temple of Speed'?",
      "options": [
        "Monza",
        "Spa-Francorchamps",
        "Monaco",
        "Silverstone"
      ],
      "correctAnswer": "Monza"
    },
    {
      "question": "What is the record for the most consecutive wins in a single season?",
      "options": [
        "13",
        "15",
        "17",
        "19"
      ],
      "correctAnswer": "13"
    },
    {
      "question": "Who was the first British driver to win a Formula 1 World Championship?",
      "options": [
        "Lewis Hamilton",
        "Mike Hawthorn",
        "Nigel Mansell",
        "Jackie Stewart"
      ],
      "correctAnswer": "Mike Hawthorn"
    },
    {
      "question": "Which is the oldest Formula 1 race still held today?",
      "options": [
        "Monaco",
        "Silverstone",
        "Monza",
        "Spa-Francorchamps"
      ],
      "correctAnswer": "Monaco"
    },
    {
      "question": "Who holds the record for the fastest lap in a Formula 1 race?",
      "options": [
        "Michael Schumacher",
        "Lewis Hamilton",
        "Max Verstappen",
        "Kimi Räikkönen"
      ],
      "correctAnswer": "Max Verstappen"
    },
    {
      "question": "What is the maximum number of drivers allowed in a Formula 1 team?",
      "options": [
        "1",
        "2",
        "3",
        "4"
      ],
      "correctAnswer": "2"
    },
    {
      "question": "Which Formula 1 race has the most wins for a single driver?",
      "options": [
        "Monaco",
        "Spa-Francorchamps",
        "Silverstone",
        "Nürburgring"
      ],
      "correctAnswer": "Spa-Francorchamps"
    },
    {
      "question": "In which Formula 1 team did Fernando Alonso win his two World Championships?",
      "options": [
        "Renault",
        "Ferrari",
        "McLaren",
        "Mercedes"
      ],
      "correctAnswer": "Renault"
    },
    {
      "question": "Which Formula 1 race track is the longest?",
      "options": [
        "Spa-Francorchamps",
        "Monza",
        "Baku",
        "Silverstone"
      ],
      "correctAnswer": "Spa-Francorchamps"
    },
    {
      "question": "Which Formula 1 driver is nicknamed 'The Iceman'?",
      "options": [
        "Sebastian Vettel",
        "Kimi Räikkönen",
        "Valtteri Bottas",
        "Daniel Ricciardo"
      ],
      "correctAnswer": "Kimi Räikkönen"
    },
    {
      "question": "Who is the youngest Formula 1 World Champion?",
      "options": [
        "Sebastian Vettel",
        "Lewis Hamilton",
        "Ayrton Senna",
        "Michael Schumacher"
      ],
      "correctAnswer": "Sebastian Vettel"
    },
    {
      "question": "Which driver has won the most Grands Prix in a single season?",
      "options": [
        "Michael Schumacher",
        "Lewis Hamilton",
        "Max Verstappen",
        "Nigel Mansell"
      ],
      "correctAnswer": "Max Verstappen"
    },
    {
      "question": "What is the iconic race held at the Circuit de Monaco known as?",
      "options": [
        "Monaco Grand Prix",
        "Monaco Madness",
        "Monaco Circuit Race",
        "Monte Carlo Grand Prix"
      ],
      "correctAnswer": "Monaco Grand Prix"
    },
    {
      "question": "Who holds the record for the most pole positions in Formula 1?",
      "options": [
        "Lewis Hamilton",
        "Ayrton Senna",
        "Sebastian Vettel",
        "Michael Schumacher"
      ],
      "correctAnswer": "Lewis Hamilton"
    },
    {
      "question": "Which Formula 1 team is known as 'The Prancing Horse'?",
      "options": [
        "Mercedes",
        "Red Bull Racing",
        "Ferrari",
        "McLaren"
      ],
      "correctAnswer": "Ferrari"
    },
    {
      "question": "Who holds the record for the most consecutive pole positions in Formula 1?",
      "options": [
        "Lewis Hamilton",
        "Ayrton Senna",
        "Sebastian Vettel",
        "Michael Schumacher"
      ],
      "correctAnswer": "Lewis Hamilton"
    },
    {
      "question": "In which year did the first night race in Formula 1 take place?",
      "options": [
        "2007",
        "2008",
        "2009",
        "2010"
      ],
      "correctAnswer": "2008"
    },
    {
      "question": "Which driver is known as the 'Flying Finn' in Formula 1?",
      "options": [
        "Kimi Räikkönen",
        "Valtteri Bottas",
        "Mika Häkkinen",
        "Keke Rosberg"
      ],
      "correctAnswer": "Kimi Räikkönen"
    },
    {
      "question": "What is the official tire supplier for Formula 1?",
      "options": [
        "Pirelli",
        "Michelin",
        "Bridgestone",
        "Goodyear"
      ],
      "correctAnswer": "Pirelli"
    },
    {
      "question": "Who is the only driver to win the Indianapolis 500, Le Mans 24 Hours, and Formula 1 World Championship?",
      "options": [
        "Graham Hill",
        "Juan Pablo Montoya",
        "Jim Clark",
        "Emerson Fittipaldi"
      ],
      "correctAnswer": "Graham Hill"
    },
    {
      "question": "Which Grand Prix is known for its unpredictable weather conditions, often dubbed as 'The Race of the Unpredictables'?",
      "options": [
        "Canadian Grand Prix",
        "Belgian Grand Prix",
        "Malaysian Grand Prix",
        "Brazilian Grand Prix"
      ],
      "correctAnswer": "Belgian Grand Prix"
    },
    {
      "question": "Which team won the first-ever Formula 1 race?",
      "options": [
        "Alfa Romeo",
        "Ferrari",
        "Mercedes",
        "Red Bull Racing"
      ],
      "correctAnswer": "Alfa Romeo"
    },
    {
      "question": "Who holds the record for the most podium finishes in Formula 1 history?",
      "options": [
        "Lewis Hamilton",
        "Michael Schumacher",
        "Ayrton Senna",
        "Sebastian Vettel"
      ],
      "correctAnswer": "Lewis Hamilton"
    },
    {
      "question": "In which country is the Red Bull Ring located?",
      "options": [
        "Austria",
        "Germany",
        "Hungary",
        "Belgium"
      ],
      "correctAnswer": "Austria"
    },
    {
      "question": "Which driver famously won the 1996 Monaco Grand Prix despite starting in 14th position?",
      "options": [
        "Olivier Panis",
        "Damon Hill",
        "Jean Alesi",
        "Rubens Barrichello"
      ],
      "correctAnswer": "Olivier Panis"
    },
    {
      "question": "What is the minimum weight requirement for a Formula 1 car (excluding driver and fuel)?",
      "options": [
        "620 kg",
        "650 kg",
        "700 kg",
        "750 kg"
      ],
      "correctAnswer": "620 kg"
    },
    {
      "question": "Who is the only driver to have won a World Championship for both Ferrari and McLaren?",
      "options": [
        "Fernando Alonso",
        "Sebastian Vettel",
        "Alain Prost",
        "Ayrton Senna"
      ],
      "correctAnswer": "Alain Prost"
    },
    {
      "question": "Which city hosts the United States Grand Prix?",
      "options": [
        "New York",
        "Los Angeles",
        "Austin",
        "Miami"
      ],
      "correctAnswer": "Austin"
    },
    {
      "question": "What is the name of the trophy awarded to the winner of the Formula 1 World Championship?",
      "options": [
        "Gold Cup",
        "Silver Goblet",
        "Drivers' Trophy",
        "FIA Cup"
      ],
      "correctAnswer": "Drivers' Trophy"
    },
    {
      "question": "Which driver holds the record for the most consecutive World Championships?",
      "options": [
        "Juan Manuel Fangio",
        "Ayrton Senna",
        "Michael Schumacher",
        "Sebastian Vettel"
      ],
      "correctAnswer": "Michael Schumacher"
    },
    {
      "question": "In which year did the first official Formula 1 race take place?",
      "options": [
        "1948",
        "1950",
        "1952",
        "1954"
      ],
      "correctAnswer": "1950"
    },
    {
      "question": "Who is the only driver to win a World Championship with a privateer (non-manufacturer) team?",
      "options": [
        "Nino Farina",
        "Stirling Moss",
        "Jack Brabham",
        "Graham Hill"
      ],
      "correctAnswer": "Jack Brabham"
    },
    {
      "question": "Which team introduced the first-ever mid-engined car in Formula 1?",
      "options": [
        "Ferrari",
        "Lotus",
        "Mercedes",
        "McLaren"
      ],
      "correctAnswer": "Cooper"
    },
    {
      "question": "Who is the youngest race winner in Formula 1 history?",
      "options": [
        "Max Verstappen",
        "Sebastian Vettel",
        "Fernando Alonso",
        "Charles Leclerc"
      ],
      "correctAnswer": "Max Verstappen"
    },
    {
      "question": "Which driver is known for his famous 'Shoey' celebration on the podium?",
      "options": [
        "Daniel Ricciardo",
        "Nico Hülkenberg",
        "Sergio Pérez",
        "Carlos Sainz"
      ],
      "correctAnswer": "Daniel Ricciardo"
    },
    {
      "question": "What is the official name of the race held at the Circuit de Catalunya in Spain?",
      "options": [
        "Spanish Grand Prix",
        "Catalan Grand Prix",
        "Barcelona Grand Prix",
        "Circuit de Catalunya Grand Prix"
      ],
      "correctAnswer": "Spanish Grand Prix"
    },
    {
      "question": "Who is the most successful British driver in terms of World Championships?",
      "options": [
        "Lewis Hamilton",
        "Nigel Mansell",
        "Damon Hill",
        "Jackie Stewart"
      ],
      "correctAnswer": "Lewis Hamilton"
    },
    {
      "question": "Which constructor has the most consecutive Constructors' Championships?",
      "options": [
        "Ferrari",
        "McLaren",
        "Mercedes",
        "Red Bull Racing"
      ],
      "correctAnswer": "Ferrari"
    },
    {
      "question": "In which year did the first Formula 1 race take place at the Circuit of the Americas in Austin?",
      "options": [
        "2010",
        "2012",
        "2014",
        "2016"
      ],
      "correctAnswer": "2012"
    },
    {
      "question": "Who is the only driver to win the Formula 1 World Championship with a turbocharged car?",
      "options": [
        "Nelson Piquet",
        "Alain Prost",
        "Ayrton Senna",
        "Michael Schumacher"
      ],
      "correctAnswer": "Nelson Piquet"
    },
    {
      "question": "Which Grand Prix is held at the Red Bull Ring?",
      "options": [
        "Austrian Grand Prix",
        "German Grand Prix",
        "Hungarian Grand Prix",
        "Belgian Grand Prix"
      ],
      "correctAnswer": "Austrian Grand Prix"
    },
    {
      "question": "What is the nickname of the Suzuka International Racing Course in Japan?",
      "options": [
        "Suzuka Speedway",
        "Suzuka Circuit",
        "Suzuka Grand Prix",
        "Suzuka Rollercoaster"
      ],
      "correctAnswer": "Suzuka Circuit"
    },
    {
      "question": "Who is the only driver to win a Formula 1 World Championship with a six-wheeled car?",
      "options": [
        "Ayrton Senna",
        "Alain Prost",
        "Nigel Mansell",
        "Keke Rosberg"
      ],
      "correctAnswer": "Keke Rosberg"
    },
    {
      "question": "What is the name of the corner known for its high-speed challenge at the Monza circuit?",
      "options": [
        "Parabolica",
        "Ascari",
        "Lesmo",
        "Rettifilo"
      ],
      "correctAnswer": "Parabolica"
    },
    {
      "question": "Who is the only driver to win a Formula 1 World Championship with a one-off livery?",
      "options": [
        "Ayrton Senna",
        "Michael Schumacher",
        "Lewis Hamilton",
        "Damon Hill"
      ],
      "correctAnswer": "Damon Hill"
    },
    {
      "question": "In which year did the first female driver participate in a Formula 1 race?",
      "options": [
        "1976",
        "1980",
        "1982",
        "1985"
      ],
      "correctAnswer": "1976"
    },
    {
      "question": "Who is the most successful German driver in terms of World Championships?",
      "options": [
        "Sebastian Vettel",
        "Michael Schumacher",
        "Nico Rosberg",
        "Nico Hülkenberg"
      ],
      "correctAnswer": "Michael Schumacher"
    },
    {
      "question": "Which constructor has won the most consecutive Constructors' Championships?",
      "options": [
        "Mercedes",
        "Ferrari",
        "Red Bull Racing",
        "McLaren"
      ],
      "correctAnswer": "Mercedes"
    },
    {
      "question": "Who is the only driver to win the Formula 1 World Championship with a car featuring a 'fan' system?",
      "options": [
        "Niki Lauda",
        "Mario Andretti",
        "Emerson Fittipaldi",
        "James Hunt"
      ],
      "correctAnswer": "Mario Andretti"
    },
    {
      "question": "Which Grand Prix is held at the Marina Bay Street Circuit?",
      "options": [
        "Singapore Grand Prix",
        "Malaysian Grand Prix",
        "Australian Grand Prix",
        "Chinese Grand Prix"
      ],
      "correctAnswer": "Singapore Grand Prix"
    },
    {
      "question": "What is the name of the corner known for its challenging elevation changes at the Circuit of the Americas?",
      "options": [
        "Turn 1",
        "The Esses",
        "The Carousel",
        "The Corkscrew"
      ],
      "correctAnswer": "The Esses"
    },
    {
      "question": "Who is the only driver to win a Formula 1 World Championship with a car featuring a 'fan' system?",
      "options": [
        "Niki Lauda",
        "Mario Andretti",
        "Emerson Fittipaldi",
        "James Hunt"
      ],
      "correctAnswer": "Mario Andretti"
    },
    {
      "question": "Which Grand Prix is held at the Marina Bay Street Circuit?",
      "options": [
        "Singapore Grand Prix",
        "Malaysian Grand Prix",
        "Australian Grand Prix",
        "Chinese Grand Prix"
      ],
      "correctAnswer": "Singapore Grand Prix"
    },
    {
      "question": "What is the name of the corner known for its challenging elevation changes at the Circuit of the Americas?",
      "options": [
        "Turn 1",
        "The Esses",
        "The Carousel",
        "The Corkscrew"
      ],
      "correctAnswer": "The Esses"
    },
    {
      "question": "Who is the only driver to win a Formula 1 World Championship with a car featuring a 'fan' system?",
      "options": [
        "Niki Lauda",
        "Mario Andretti",
        "Emerson Fittipaldi",
        "James Hunt"
      ],
      "correctAnswer": "Mario Andretti"
    },
    {
      "question": "Which Grand Prix is held at the Marina Bay Street Circuit?",
      "options": [
        "Singapore Grand Prix",
        "Malaysian Grand Prix",
        "Australian Grand Prix",
        "Chinese Grand Prix"
      ],
      "correctAnswer": "Singapore Grand Prix"
    },
    {
      "question": "What is the name of the corner known for its challenging elevation changes at the Circuit of the Americas?",
      "options": [
        "Turn 1",
        "The Esses",
        "The Carousel",
        "The Corkscrew"
      ],
      "correctAnswer": "The Esses"
    },
    {
      "question": "Who is the only driver to win a Formula 1 World Championship with a car featuring a 'fan' system?",
      "options": [
        "Niki Lauda",
        "Mario Andretti",
        "Emerson Fittipaldi",
        "James Hunt"
      ],
      "correctAnswer": "Mario Andretti"
    },
    {
      "question": "Which Grand Prix is held at the Marina Bay Street Circuit?",
      "options": [
        "Singapore Grand Prix",
        "Malaysian Grand Prix",
        "Australian Grand Prix",
        "Chinese Grand Prix"
      ],
      "correctAnswer": "Singapore Grand Prix"
    },
    {
      "question": "What is the name of the corner known for its challenging elevation changes at the Circuit of the Americas?",
      "options": [
        "Turn 1",
        "The Esses",
        "The Carousel",
        "The Corkscrew"
      ],
      "correctAnswer": "The Esses"
    },
    {
      "question": "Who is the only driver to win a Formula 1 World Championship with a car featuring a 'fan' system?",
      "options": [
        "Niki Lauda",
        "Mario Andretti",
        "Emerson Fittipaldi",
        "James Hunt"
      ],
      "correctAnswer": "Mario Andretti"
    },
    {
      "question": "Which Grand Prix is held at the Marina Bay Street Circuit?",
      "options": [
        "Singapore Grand Prix",
        "Malaysian Grand Prix",
        "Australian Grand Prix",
        "Chinese Grand Prix"
      ],
      "correctAnswer": "Singapore Grand Prix"
    },
    {
      "question": "What is the name of the corner known for its challenging elevation changes at the Circuit of the Americas?",
      "options": [
        "Turn 1",
        "The Esses",
        "The Carousel",
        "The Corkscrew"
      ],
      "correctAnswer": "The Esses"
    },
    {
      "question": "Who is the only driver to win a Formula 1 World Championship with a car featuring a 'fan' system?",
      "options": [
        "Niki Lauda",
        "Mario Andretti",
        "Emerson Fittipaldi",
        "James Hunt"
      ],
      "correctAnswer": "Mario Andretti"
    },
    {
      "question": "Which Grand Prix is held at the Marina Bay Street Circuit?",
      "options": [
        "Singapore Grand Prix",
        "Malaysian Grand Prix",
        "Australian Grand Prix",
        "Chinese Grand Prix"
      ],
      "correctAnswer": "Singapore Grand Prix"
    },
    {
      "question": "Which Grand Prix is held at the Suzuka International Racing Course?",
      "options": [
        "Japanese Grand Prix",
        "Chinese Grand Prix",
        "Malaysian Grand Prix",
        "Australian Grand Prix"
      ],
      "correctAnswer": "Japanese Grand Prix"
    }
  ],
  "leaderboard": [
    {
      "id": 1,
      "user": "adimn",
      "points": 3,
      "role": "Admin"
    },
    {
      "user": "adimn",
      "points": 10,
      "role": "Admin",
      "id": 2
    },
    {
      "user": "adimn",
      "points": 8,
      "role": "Admin",
      "id": 3
    },
    {
      "user": "zabubakav",
      "points": 0,
      "role": "User",
      "id": 4
    },
    {
      "user": "zabubakav",
      "points": 10,
      "role": "User",
      "id": 5
    },
    {
      "user": "adimn",
      "points": 20,
      "role": "Admin",
      "id": 6
    },
    {
      "user": "adimn",
      "points": 0,
      "role": "Admin",
      "id": 7
    },
    {
      "user": "adimn",
      "points": 7,
      "role": "Admin",
      "id": 8
    },
    {
      "user": "user",
      "points": 0,
      "role": "User",
      "id": 9
    },
    {
      "user": "user",
      "points": 8,
      "role": "User",
      "id": 10
    },
    {
      "user": "user",
      "points": 0,
      "role": "User",
      "id": 11
    },
    {
      "user": "user",
      "points": 6,
      "role": "User",
      "id": 12
    },
    {
      "user": "user",
      "points": 8,
      "role": "User",
      "id": 13
    },
    {
      "user": "user",
      "points": 10,
      "role": "User",
      "id": 14
    },
    {
      "user": "user",
      "points": 0,
      "role": "User",
      "id": 15
    },
    {
      "user": "user",
      "points": 13,
      "role": "User",
      "id": 16
    },
    {
      "user": "user",
      "points": 13,
      "role": "User",
      "id": 17
    },
    {
      "user": "adimn",
      "points": 0,
      "role": "Admin",
      "id": 18
    },
    {
      "user": "adimn",
      "points": 20,
      "role": "Admin",
      "id": 19
    },
    {
      "user": "user",
      "points": 8,
      "role": "User",
      "id": 20
    },
    {
      "user": "adimn",
      "points": 0,
      "role": "Admin",
      "id": 21
    },
    {
      "user": "adimn",
      "points": 5,
      "role": "Admin",
      "id": 22
    },
    {
      "user": "adimn",
      "points": 14,
      "role": "Admin",
      "id": 23
    }
  ]
}